MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile RXF10SIDHbits_t RXF10SIDHbits __at(0xE58);
// bitfield macros
#define _RXF10SIDH_SID_POSN                                 0x0
#define _RXF10SIDH_SID_POSITION                             0x0
#define _RXF10SIDH_SID_SIZE                                 0x8
#define _RXF10SIDH_SID_LENGTH                               0x8
#define _RXF10SIDH_SID_MASK                                 0xFF
#define _RXF10SIDH_SID3_POSN                                0x0
#define _RXF10SIDH_SID3_POSITION                            0x0
#define _RXF10SIDH_SID3_SIZE                                0x1
#define _RXF10SIDH_SID3_LENGTH                              0x1
#define _RXF10SIDH_SID3_MASK                                0x1
#define _RXF10SIDH_SID4_POSN                                0x1
#define _RXF10SIDH_SID4_POSITION                            0x1
#define _RXF10SIDH_SID4_SIZE                                0x1
#define _RXF10SIDH_SID4_LENGTH                              0x1
#define _RXF10SIDH_SID4_MASK                                0x2
#define _RXF10SIDH_SID5_POSN                                0x2
#define _RXF10SIDH_SID5_POSITION                            0x2
#define _RXF10SIDH_SID5_SIZE                                0x1
#define _RXF10SIDH_SID5_LENGTH                              0x1
#define _RXF10SIDH_SID5_MASK                                0x4
#define _RXF10SIDH_SID6_POSN                                0x3
#define _RXF10SIDH_SID6_POSITION                            0x3
#define _RXF10SIDH_SID6_SIZE                                0x1
#define _RXF10SIDH_SID6_LENGTH                              0x1
#define _RXF10SIDH_SID6_MASK                                0x8
#define _RXF10SIDH_SID7_POSN                                0x4
#define _RXF10SIDH_SID7_POSITION                            0x4
#define _RXF10SIDH_SID7_SIZE                                0x1
#define _RXF10SIDH_SID7_LENGTH                              0x1
#define _RXF10SIDH_SID7_MASK                                0x10
#define _RXF10SIDH_SID8_POSN                                0x5
#define _RXF10SIDH_SID8_POSITION                            0x5
#define _RXF10SIDH_SID8_SIZE                                0x1
#define _RXF10SIDH_SID8_LENGTH                              0x1
#define _RXF10SIDH_SID8_MASK                                0x20
#define _RXF10SIDH_SID9_POSN                                0x6
#define _RXF10SIDH_SID9_POSITION                            0x6
#define _RXF10SIDH_SID9_SIZE                                0x1
#define _RXF10SIDH_SID9_LENGTH                              0x1
#define _RXF10SIDH_SID9_MASK                                0x40
#define _RXF10SIDH_SID10_POSN                               0x7
#define _RXF10SIDH_SID10_POSITION                           0x7
#define _RXF10SIDH_SID10_SIZE                               0x1
#define _RXF10SIDH_SID10_LENGTH                             0x1
#define _RXF10SIDH_SID10_MASK                               0x80
#define _RXF10SIDH_RXF10SID3_POSN                           0x0
#define _RXF10SIDH_RXF10SID3_POSITION                       0x0
#define _RXF10SIDH_RXF10SID3_SIZE                           0x1
#define _RXF10SIDH_RXF10SID3_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID3_MASK                           0x1
#define _RXF10SIDH_RXF10SID4_POSN                           0x1
#define _RXF10SIDH_RXF10SID4_POSITION                       0x1
#define _RXF10SIDH_RXF10SID4_SIZE                           0x1
#define _RXF10SIDH_RXF10SID4_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID4_MASK                           0x2
#define _RXF10SIDH_RXF10SID5_POSN                           0x2
#define _RXF10SIDH_RXF10SID5_POSITION                       0x2
#define _RXF10SIDH_RXF10SID5_SIZE                           0x1
#define _RXF10SIDH_RXF10SID5_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID5_MASK                           0x4
#define _RXF10SIDH_RXF10SID6_POSN                           0x3
#define _RXF10SIDH_RXF10SID6_POSITION                       0x3
#define _RXF10SIDH_RXF10SID6_SIZE                           0x1
#define _RXF10SIDH_RXF10SID6_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID6_MASK                           0x8
#define _RXF10SIDH_RXF10SID7_POSN                           0x4
#define _RXF10SIDH_RXF10SID7_POSITION                       0x4
#define _RXF10SIDH_RXF10SID7_SIZE                           0x1
#define _RXF10SIDH_RXF10SID7_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID7_MASK                           0x10
#define _RXF10SIDH_RXF10SID8_POSN                           0x5
#define _RXF10SIDH_RXF10SID8_POSITION                       0x5
#define _RXF10SIDH_RXF10SID8_SIZE                           0x1
#define _RXF10SIDH_RXF10SID8_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID8_MASK                           0x20
#define _RXF10SIDH_RXF10SID9_POSN                           0x6
#define _RXF10SIDH_RXF10SID9_POSITION                       0x6
#define _RXF10SIDH_RXF10SID9_SIZE                           0x1
#define _RXF10SIDH_RXF10SID9_LENGTH                         0x1
#define _RXF10SIDH_RXF10SID9_MASK                           0x40
#define _RXF10SIDH_RXF10SID10_POSN                          0x7
#define _RXF10SIDH_RXF10SID10_POSITION                      0x7
#define _RXF10SIDH_RXF10SID10_SIZE                          0x1
#define _RXF10SIDH_RXF10SID10_LENGTH                        0x1
#define _RXF10SIDH_RXF10SID10_MASK                          0x80

// Register: RXF10SIDL
#define RXF10SIDL RXF10SIDL
extern volatile unsigned char           RXF10SIDL           __at(0xE59);
#ifndef _LIB_BUILD
asm("RXF10SIDL equ 0E59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF10EID16             :1;
        unsigned RXF10EID17             :1;
        unsigned                        :1;
        unsigned RXF10EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF10SID0              :1;
        unsigned RXF10SID1              :1;
        unsigned RXF10SID2              :1;
    };
} RXF10SIDLbits_t;
extern volatile RXF10SIDLbits_t RXF10SIDLbits __at(0xE59);
// bitfield macros
#define _RXF10SIDL_EID_POSN                                 0x0
#define _RXF10SIDL_EID_POSITION                             0x0
#define _RXF10SIDL_EID_SIZE                                 0x2
#define _RXF10SIDL_EID_LENGTH                               0x2
#define _RXF10SIDL_EID_MASK                                 0x3
#define _RXF10SIDL_EXIDEN_POSN                              0x3
#define _RXF10SIDL_EXIDEN_POSITION                          0x3
#define _RXF10SIDL_EXIDEN_SIZE                              0x1
#define _RXF10SIDL_EXIDEN_LENGTH                            0x1
#define _RXF10SIDL_EXIDEN_MASK                              0x8
#define _RXF10SIDL_SID_POSN                                 0x5
#define _RXF10SIDL_SID_POSITION                             0x5
#define _RXF10SIDL_SID_SIZE                                 0x3
#define _RXF10SIDL_SID_LENGTH                               0x3
#define _RXF10SIDL_SID_MASK                                 0xE0
#define _RXF10SIDL_EID16_POSN                               0x0
#define _RXF10SIDL_EID16_POSITION                           0x0
#define _RXF10SIDL_EID16_SIZE                               0x1
#define _RXF10SIDL_EID16_LENGTH                             0x1
#define _RXF10SIDL_EID16_MASK                               0x1
#define _RXF10SIDL_EID17_POSN                               0x1
#define _RXF10SIDL_EID17_POSITION                           0x1
#define _RXF10SIDL_EID17_SIZE                               0x1
#define _RXF10SIDL_EID17_LENGTH                             0x1
#define _RXF10SIDL_EID17_MASK                               0x2
#define _RXF10SIDL_SID0_POSN                                0x5
#define _RXF10SIDL_SID0_POSITION                            0x5
#define _RXF10SIDL_SID0_SIZE                                0x1
#define _RXF10SIDL_SID0_LENGTH                              0x1
#define _RXF10SIDL_SID0_MASK                                0x20
#define _RXF10SIDL_SID1_POSN                                0x6
#define _RXF10SIDL_SID1_POSITION                            0x6
#define _RXF10SIDL_SID1_SIZE                                0x1
#define _RXF10SIDL_SID1_LENGTH                              0x1
#define _RXF10SIDL_SID1_MASK                                0x40
#define _RXF10SIDL_SID2_POSN                                0x7
#define _RXF10SIDL_SID2_POSITION                            0x7
#define _RXF10SIDL_SID2_SIZE                                0x1
#define _RXF10SIDL_SID2_LENGTH                              0x1
#define _RXF10SIDL_SID2_MASK                                0x80
#define _RXF10SIDL_RXF10EID16_POSN                          0x0
#define _RXF10SIDL_RXF10EID16_POSITION                      0x0
#define _RXF10SIDL_RXF10EID16_SIZE                          0x1
#define _RXF10SIDL_RXF10EID16_LENGTH                        0x1
#define _RXF10SIDL_RXF10EID16_MASK                          0x1
#define _RXF10SIDL_RXF10EID17_POSN                          0x1
#define _RXF10SIDL_RXF10EID17_POSITION                      0x1
#define _RXF10SIDL_RXF10EID17_SIZE                          0x1
#define _RXF10SIDL_RXF10EID17_LENGTH                        0x1
#define _RXF10SIDL_RXF10EID17_MASK                          0x2
#define _RXF10SIDL_RXF10EXIDEN_POSN                         0x3
#define _RXF10SIDL_RXF10EXIDEN_POSITION                     0x3
#define _RXF10SIDL_RXF10EXIDEN_SIZE                         0x1
#define _RXF10SIDL_RXF10EXIDEN_LENGTH                       0x1
#define _RXF10SIDL_RXF10EXIDEN_MASK                         0x8
#define _RXF10SIDL_RXF10SID0_POSN                           0x5
#define _RXF10SIDL_RXF10SID0_POSITION                       0x5
#define _RXF10SIDL_RXF10SID0_SIZE                           0x1
#define _RXF10SIDL_RXF10SID0_LENGTH                         0x1
#define _RXF10SIDL_RXF10SID0_MASK                           0x20
#define _RXF10SIDL_RXF10SID1_POSN                           0x6
#define _RXF10SIDL_RXF10SID1_POSITION                       0x6
#define _RXF10SIDL_RXF10SID1_SIZE                           0x1
#define _RXF10SIDL_RXF10SID1_LENGTH                         0x1
#define _RXF10SIDL_RXF10SID1_MASK                           0x40
#define _RXF10SIDL_RXF10SID2_POSN                           0x7
#define _RXF10SIDL_RXF10SID2_POSITION                       0x7
#define _RXF10SIDL_RXF10SID2_SIZE                           0x1
#define _RXF10SIDL_RXF10SID2_LENGTH                         0x1
#define _RXF10SIDL_RXF10SID2_MASK                           0x80

// Register: RXF10EIDH
#define RXF10EIDH RXF10EIDH
extern volatile unsigned char           RXF10EIDH           __at(0xE5A);
#ifndef _LIB_BUILD
asm("RXF10EIDH equ 0E5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF10EID8              :1;
        unsigned RXF10EID9              :1;
        unsigned RXF10EID10             :1;
        unsigned RXF10EID11             :1;
        unsigned RXF10EID12             :1;
        unsigned RXF10EID13             :1;
        unsigned RXF10EID14             :1;
        unsigned RXF10EID15             :1;
    };
} RXF10EIDHbits_t;
extern volatile RXF10EIDHbits_t RXF10EIDHbits __at(0xE5A);
// bitfield macros
#define _RXF10EIDH_EID_POSN                                 0x0
#define _RXF10EIDH_EID_POSITION                             0x0
#define _RXF10EIDH_EID_SIZE                                 0x8
#define _RXF10EIDH_EID_LENGTH                               0x8
#define _RXF10EIDH_EID_MASK                                 0xFF
#define _RXF10EIDH_EID8_POSN                                0x0
#define _RXF10EIDH_EID8_POSITION                            0x0
#define _RXF10EIDH_EID8_SIZE                                0x1
#define _RXF10EIDH_EID8_LENGTH                              0x1
#define _RXF10EIDH_EID8_MASK                                0x1
#define _RXF10EIDH_EID9_POSN                                0x1
#define _RXF10EIDH_EID9_POSITION                            0x1
#define _RXF10EIDH_EID9_SIZE                                0x1
#define _RXF10EIDH_EID9_LENGTH                              0x1
#define _RXF10EIDH_EID9_MASK                                0x2
#define _RXF10EIDH_EID10_POSN                               0x2
#define _RXF10EIDH_EID10_POSITION                           0x2
#define _RXF10EIDH_EID10_SIZE                               0x1
#define _RXF10EIDH_EID10_LENGTH                             0x1
#define _RXF10EIDH_EID10_MASK                               0x4
#define _RXF10EIDH_EID11_POSN                               0x3
#define _RXF10EIDH_EID11_POSITION                           0x3
#define _RXF10EIDH_EID11_SIZE                               0x1
#define _RXF10EIDH_EID11_LENGTH                             0x1
#define _RXF10EIDH_EID11_MASK                               0x8
#define _RXF10EIDH_EID12_POSN                               0x4
#define _RXF10EIDH_EID12_POSITION                           0x4
#define _RXF10EIDH_EID12_SIZE                               0x1
#define _RXF10EIDH_EID12_LENGTH                             0x1
#define _RXF10EIDH_EID12_MASK                               0x10
#define _RXF10EIDH_EID13_POSN                               0x5
#define _RXF10EIDH_EID13_POSITION                           0x5
#define _RXF10EIDH_EID13_SIZE                               0x1
#define _RXF10EIDH_EID13_LENGTH                             0x1
#define _RXF10EIDH_EID13_MASK                               0x20
#define _RXF10EIDH_EID14_POSN                               0x6
#define _RXF10EIDH_EID14_POSITION                           0x6
#define _RXF10EIDH_EID14_SIZE                               0x1
#define _RXF10EIDH_EID14_LENGTH                             0x1
#define _RXF10EIDH_EID14_MASK                               0x40
#define _RXF10EIDH_EID15_POSN                               0x7
#define _RXF10EIDH_EID15_POSITION                           0x7
#define _RXF10EIDH_EID15_SIZE                               0x1
#define _RXF10EIDH_EID15_LENGTH                             0x1
#define _RXF10EIDH_EID15_MASK                               0x80
#define _RXF10EIDH_RXF10EID8_POSN                           0x0
#define _RXF10EIDH_RXF10EID8_POSITION                       0x0
#define _RXF10EIDH_RXF10EID8_SIZE                           0x1
#define _RXF10EIDH_RXF10EID8_LENGTH                         0x1
#define _RXF10EIDH_RXF10EID8_MASK                           0x1
#define _RXF10EIDH_RXF10EID9_POSN                           0x1
#define _RXF10EIDH_RXF10EID9_POSITION                       0x1
#define _RXF10EIDH_RXF10EID9_SIZE                           0x1
#define _RXF10EIDH_RXF10EID9_LENGTH                         0x1
#define _RXF10EIDH_RXF10EID9_MASK                           0x2
#define _RXF10EIDH_RXF10EID10_POSN                          0x2
#define _RXF10EIDH_RXF10EID10_POSITION                      0x2
#define _RXF10EIDH_RXF10EID10_SIZE                          0x1
#define _RXF10EIDH_RXF10EID10_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID10_MASK                          0x4
#define _RXF10EIDH_RXF10EID11_POSN                          0x3
#define _RXF10EIDH_RXF10EID11_POSITION                      0x3
#define _RXF10EIDH_RXF10EID11_SIZE                          0x1
#define _RXF10EIDH_RXF10EID11_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID11_MASK                          0x8
#define _RXF10EIDH_RXF10EID12_POSN                          0x4
#define _RXF10EIDH_RXF10EID12_POSITION                      0x4
#define _RXF10EIDH_RXF10EID12_SIZE                          0x1
#define _RXF10EIDH_RXF10EID12_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID12_MASK                          0x10
#define _RXF10EIDH_RXF10EID13_POSN                          0x5
#define _RXF10EIDH_RXF10EID13_POSITION                      0x5
#define _RXF10EIDH_RXF10EID13_SIZE                          0x1
#define _RXF10EIDH_RXF10EID13_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID13_MASK                          0x20
#define _RXF10EIDH_RXF10EID14_POSN                          0x6
#define _RXF10EIDH_RXF10EID14_POSITION                      0x6
#define _RXF10EIDH_RXF10EID14_SIZE                          0x1
#define _RXF10EIDH_RXF10EID14_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID14_MASK                          0x40
#define _RXF10EIDH_RXF10EID15_POSN                          0x7
#define _RXF10EIDH_RXF10EID15_POSITION                      0x7
#define _RXF10EIDH_RXF10EID15_SIZE                          0x1
#define _RXF10EIDH_RXF10EID15_LENGTH                        0x1
#define _RXF10EIDH_RXF10EID15_MASK                          0x80

// Register: RXF10EIDL
#define RXF10EIDL RXF10EIDL
extern volatile unsigned char           RXF10EIDL           __at(0xE5B);
#ifndef _LIB_BUILD
asm("RXF10EIDL equ 0E5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF10EID0              :1;
        unsigned RXF10EID1              :1;
        unsigned RXF10EID2              :1;
        unsigned RXF10EID3              :1;
        unsigned RXF10EID4              :1;
        unsigned RXF10EID5              :1;
        unsigned RXF10EID6              :1;
        unsigned RXF10EID7              :1;
    };
} RXF10EIDLbits_t;
