MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
// Register: RXF13SIDL
#define RXF13SIDL RXF13SIDL
extern volatile unsigned char           RXF13SIDL           __at(0xE65);
#ifndef _LIB_BUILD
asm("RXF13SIDL equ 0E65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF13EID16             :1;
        unsigned RXF13EID17             :1;
        unsigned                        :1;
        unsigned RXF13EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF13SID0              :1;
        unsigned RXF13SID1              :1;
        unsigned RXF13SID2              :1;
    };
} RXF13SIDLbits_t;
extern volatile RXF13SIDLbits_t RXF13SIDLbits __at(0xE65);
// bitfield macros
#define _RXF13SIDL_EID_POSN                                 0x0
#define _RXF13SIDL_EID_POSITION                             0x0
#define _RXF13SIDL_EID_SIZE                                 0x2
#define _RXF13SIDL_EID_LENGTH                               0x2
#define _RXF13SIDL_EID_MASK                                 0x3
#define _RXF13SIDL_EXIDEN_POSN                              0x3
#define _RXF13SIDL_EXIDEN_POSITION                          0x3
#define _RXF13SIDL_EXIDEN_SIZE                              0x1
#define _RXF13SIDL_EXIDEN_LENGTH                            0x1
#define _RXF13SIDL_EXIDEN_MASK                              0x8
#define _RXF13SIDL_SID_POSN                                 0x5
#define _RXF13SIDL_SID_POSITION                             0x5
#define _RXF13SIDL_SID_SIZE                                 0x3
#define _RXF13SIDL_SID_LENGTH                               0x3
#define _RXF13SIDL_SID_MASK                                 0xE0
#define _RXF13SIDL_EID16_POSN                               0x0
#define _RXF13SIDL_EID16_POSITION                           0x0
#define _RXF13SIDL_EID16_SIZE                               0x1
#define _RXF13SIDL_EID16_LENGTH                             0x1
#define _RXF13SIDL_EID16_MASK                               0x1
#define _RXF13SIDL_EID17_POSN                               0x1
#define _RXF13SIDL_EID17_POSITION                           0x1
#define _RXF13SIDL_EID17_SIZE                               0x1
#define _RXF13SIDL_EID17_LENGTH                             0x1
#define _RXF13SIDL_EID17_MASK                               0x2
#define _RXF13SIDL_SID0_POSN                                0x5
#define _RXF13SIDL_SID0_POSITION                            0x5
#define _RXF13SIDL_SID0_SIZE                                0x1
#define _RXF13SIDL_SID0_LENGTH                              0x1
#define _RXF13SIDL_SID0_MASK                                0x20
#define _RXF13SIDL_SID1_POSN                                0x6
#define _RXF13SIDL_SID1_POSITION                            0x6
#define _RXF13SIDL_SID1_SIZE                                0x1
#define _RXF13SIDL_SID1_LENGTH                              0x1
#define _RXF13SIDL_SID1_MASK                                0x40
#define _RXF13SIDL_SID2_POSN                                0x7
#define _RXF13SIDL_SID2_POSITION                            0x7
#define _RXF13SIDL_SID2_SIZE                                0x1
#define _RXF13SIDL_SID2_LENGTH                              0x1
#define _RXF13SIDL_SID2_MASK                                0x80
#define _RXF13SIDL_RXF13EID16_POSN                          0x0
#define _RXF13SIDL_RXF13EID16_POSITION                      0x0
#define _RXF13SIDL_RXF13EID16_SIZE                          0x1
#define _RXF13SIDL_RXF13EID16_LENGTH                        0x1
#define _RXF13SIDL_RXF13EID16_MASK                          0x1
#define _RXF13SIDL_RXF13EID17_POSN                          0x1
#define _RXF13SIDL_RXF13EID17_POSITION                      0x1
#define _RXF13SIDL_RXF13EID17_SIZE                          0x1
#define _RXF13SIDL_RXF13EID17_LENGTH                        0x1
#define _RXF13SIDL_RXF13EID17_MASK                          0x2
#define _RXF13SIDL_RXF13EXIDEN_POSN                         0x3
#define _RXF13SIDL_RXF13EXIDEN_POSITION                     0x3
#define _RXF13SIDL_RXF13EXIDEN_SIZE                         0x1
#define _RXF13SIDL_RXF13EXIDEN_LENGTH                       0x1
#define _RXF13SIDL_RXF13EXIDEN_MASK                         0x8
#define _RXF13SIDL_RXF13SID0_POSN                           0x5
#define _RXF13SIDL_RXF13SID0_POSITION                       0x5
#define _RXF13SIDL_RXF13SID0_SIZE                           0x1
#define _RXF13SIDL_RXF13SID0_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID0_MASK                           0x20
#define _RXF13SIDL_RXF13SID1_POSN                           0x6
#define _RXF13SIDL_RXF13SID1_POSITION                       0x6
#define _RXF13SIDL_RXF13SID1_SIZE                           0x1
#define _RXF13SIDL_RXF13SID1_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID1_MASK                           0x40
#define _RXF13SIDL_RXF13SID2_POSN                           0x7
#define _RXF13SIDL_RXF13SID2_POSITION                       0x7
#define _RXF13SIDL_RXF13SID2_SIZE                           0x1
#define _RXF13SIDL_RXF13SID2_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID2_MASK                           0x80

// Register: RXF13EIDH
#define RXF13EIDH RXF13EIDH
extern volatile unsigned char           RXF13EIDH           __at(0xE66);
#ifndef _LIB_BUILD
asm("RXF13EIDH equ 0E66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF13EID8              :1;
        unsigned RXF13EID9              :1;
        unsigned RXF13EID10             :1;
        unsigned RXF13EID11             :1;
        unsigned RXF13EID12             :1;
        unsigned RXF13EID13             :1;
        unsigned RXF13EID14             :1;
        unsigned RXF13EID15             :1;
    };
} RXF13EIDHbits_t;
extern volatile RXF13EIDHbits_t RXF13EIDHbits __at(0xE66);
// bitfield macros
#define _RXF13EIDH_EID_POSN                                 0x0
#define _RXF13EIDH_EID_POSITION                             0x0
#define _RXF13EIDH_EID_SIZE                                 0x8
#define _RXF13EIDH_EID_LENGTH                               0x8
#define _RXF13EIDH_EID_MASK                                 0xFF
#define _RXF13EIDH_EID8_POSN                                0x0
#define _RXF13EIDH_EID8_POSITION                            0x0
#define _RXF13EIDH_EID8_SIZE                                0x1
#define _RXF13EIDH_EID8_LENGTH                              0x1
#define _RXF13EIDH_EID8_MASK                                0x1
#define _RXF13EIDH_EID9_POSN                                0x1
#define _RXF13EIDH_EID9_POSITION                            0x1
#define _RXF13EIDH_EID9_SIZE                                0x1
#define _RXF13EIDH_EID9_LENGTH                              0x1
#define _RXF13EIDH_EID9_MASK                                0x2
#define _RXF13EIDH_EID10_POSN                               0x2
#define _RXF13EIDH_EID10_POSITION                           0x2
#define _RXF13EIDH_EID10_SIZE                               0x1
#define _RXF13EIDH_EID10_LENGTH                             0x1
#define _RXF13EIDH_EID10_MASK                               0x4
#define _RXF13EIDH_EID11_POSN                               0x3
#define _RXF13EIDH_EID11_POSITION                           0x3
#define _RXF13EIDH_EID11_SIZE                               0x1
#define _RXF13EIDH_EID11_LENGTH                             0x1
#define _RXF13EIDH_EID11_MASK                               0x8
#define _RXF13EIDH_EID12_POSN                               0x4
#define _RXF13EIDH_EID12_POSITION                           0x4
#define _RXF13EIDH_EID12_SIZE                               0x1
#define _RXF13EIDH_EID12_LENGTH                             0x1
#define _RXF13EIDH_EID12_MASK                               0x10
#define _RXF13EIDH_EID13_POSN                               0x5
#define _RXF13EIDH_EID13_POSITION                           0x5
#define _RXF13EIDH_EID13_SIZE                               0x1
#define _RXF13EIDH_EID13_LENGTH                             0x1
#define _RXF13EIDH_EID13_MASK                               0x20
#define _RXF13EIDH_EID14_POSN                               0x6
#define _RXF13EIDH_EID14_POSITION                           0x6
#define _RXF13EIDH_EID14_SIZE                               0x1
#define _RXF13EIDH_EID14_LENGTH                             0x1
#define _RXF13EIDH_EID14_MASK                               0x40
#define _RXF13EIDH_EID15_POSN                               0x7
#define _RXF13EIDH_EID15_POSITION                           0x7
#define _RXF13EIDH_EID15_SIZE                               0x1
#define _RXF13EIDH_EID15_LENGTH                             0x1
#define _RXF13EIDH_EID15_MASK                               0x80
#define _RXF13EIDH_RXF13EID8_POSN                           0x0
#define _RXF13EIDH_RXF13EID8_POSITION                       0x0
#define _RXF13EIDH_RXF13EID8_SIZE                           0x1
#define _RXF13EIDH_RXF13EID8_LENGTH                         0x1
#define _RXF13EIDH_RXF13EID8_MASK                           0x1
#define _RXF13EIDH_RXF13EID9_POSN                           0x1
#define _RXF13EIDH_RXF13EID9_POSITION                       0x1
#define _RXF13EIDH_RXF13EID9_SIZE                           0x1
#define _RXF13EIDH_RXF13EID9_LENGTH                         0x1
#define _RXF13EIDH_RXF13EID9_MASK                           0x2
#define _RXF13EIDH_RXF13EID10_POSN                          0x2
#define _RXF13EIDH_RXF13EID10_POSITION                      0x2
#define _RXF13EIDH_RXF13EID10_SIZE                          0x1
#define _RXF13EIDH_RXF13EID10_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID10_MASK                          0x4
#define _RXF13EIDH_RXF13EID11_POSN                          0x3
#define _RXF13EIDH_RXF13EID11_POSITION                      0x3
#define _RXF13EIDH_RXF13EID11_SIZE                          0x1
#define _RXF13EIDH_RXF13EID11_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID11_MASK                          0x8
#define _RXF13EIDH_RXF13EID12_POSN                          0x4
#define _RXF13EIDH_RXF13EID12_POSITION                      0x4
#define _RXF13EIDH_RXF13EID12_SIZE                          0x1
#define _RXF13EIDH_RXF13EID12_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID12_MASK                          0x10
#define _RXF13EIDH_RXF13EID13_POSN                          0x5
#define _RXF13EIDH_RXF13EID13_POSITION                      0x5
#define _RXF13EIDH_RXF13EID13_SIZE                          0x1
#define _RXF13EIDH_RXF13EID13_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID13_MASK                          0x20
#define _RXF13EIDH_RXF13EID14_POSN                          0x6
#define _RXF13EIDH_RXF13EID14_POSITION                      0x6
#define _RXF13EIDH_RXF13EID14_SIZE                          0x1
#define _RXF13EIDH_RXF13EID14_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID14_MASK                          0x40
#define _RXF13EIDH_RXF13EID15_POSN                          0x7
#define _RXF13EIDH_RXF13EID15_POSITION                      0x7
#define _RXF13EIDH_RXF13EID15_SIZE                          0x1
#define _RXF13EIDH_RXF13EID15_LENGTH                        0x1
#define _RXF13EIDH_RXF13EID15_MASK                          0x80

// Register: RXF13EIDL
#define RXF13EIDL RXF13EIDL
extern volatile unsigned char           RXF13EIDL           __at(0xE67);
#ifndef _LIB_BUILD
asm("RXF13EIDL equ 0E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF13EID0              :1;
        unsigned RXF13EID1              :1;
        unsigned RXF13EID2              :1;
        unsigned RXF13EID3              :1;
        unsigned RXF13EID4              :1;
        unsigned RXF13EID5              :1;
        unsigned RXF13EID6              :1;
        unsigned RXF13EID7              :1;
    };
} RXF13EIDLbits_t;
extern volatile RXF13EIDLbits_t RXF13EIDLbits __at(0xE67);
// bitfield macros
#define _RXF13EIDL_EID_POSN                                 0x0
#define _RXF13EIDL_EID_POSITION                             0x0
#define _RXF13EIDL_EID_SIZE                                 0x8
#define _RXF13EIDL_EID_LENGTH                               0x8
#define _RXF13EIDL_EID_MASK                                 0xFF
#define _RXF13EIDL_EID0_POSN                                0x0
#define _RXF13EIDL_EID0_POSITION                            0x0
#define _RXF13EIDL_EID0_SIZE                                0x1
#define _RXF13EIDL_EID0_LENGTH                              0x1
#define _RXF13EIDL_EID0_MASK                                0x1
#define _RXF13EIDL_EID1_POSN                                0x1
#define _RXF13EIDL_EID1_POSITION                            0x1
#define _RXF13EIDL_EID1_SIZE                                0x1
#define _RXF13EIDL_EID1_LENGTH                              0x1
#define _RXF13EIDL_EID1_MASK                                0x2
#define _RXF13EIDL_EID2_POSN                                0x2
#define _RXF13EIDL_EID2_POSITION                            0x2
#define _RXF13EIDL_EID2_SIZE                                0x1
#define _RXF13EIDL_EID2_LENGTH                              0x1
#define _RXF13EIDL_EID2_MASK                                0x4
#define _RXF13EIDL_EID3_POSN                                0x3
#define _RXF13EIDL_EID3_POSITION                            0x3
#define _RXF13EIDL_EID3_SIZE                                0x1
#define _RXF13EIDL_EID3_LENGTH                              0x1
#define _RXF13EIDL_EID3_MASK                                0x8
#define _RXF13EIDL_EID4_POSN                                0x4
#define _RXF13EIDL_EID4_POSITION                            0x4
#define _RXF13EIDL_EID4_SIZE                                0x1
#define _RXF13EIDL_EID4_LENGTH                              0x1
#define _RXF13EIDL_EID4_MASK                                0x10
#define _RXF13EIDL_EID5_POSN                                0x5
#define _RXF13EIDL_EID5_POSITION                            0x5
#define _RXF13EIDL_EID5_SIZE                                0x1
#define _RXF13EIDL_EID5_LENGTH                              0x1
#define _RXF13EIDL_EID5_MASK                                0x20
#define _RXF13EIDL_EID6_POSN                                0x6
#define _RXF13EIDL_EID6_POSITION                            0x6
#define _RXF13EIDL_EID6_SIZE                                0x1
#define _RXF13EIDL_EID6_LENGTH                              0x1
#define _RXF13EIDL_EID6_MASK                                0x40
#define _RXF13EIDL_EID7_POSN                                0x7
#define _RXF13EIDL_EID7_POSITION                            0x7
#define _RXF13EIDL_EID7_SIZE                                0x1
#define _RXF13EIDL_EID7_LENGTH                              0x1
#define _RXF13EIDL_EID7_MASK                                0x80
#define _RXF13EIDL_RXF13EID0_POSN                           0x0
#define _RXF13EIDL_RXF13EID0_POSITION                       0x0
#define _RXF13EIDL_RXF13EID0_SIZE                           0x1
#define _RXF13EIDL_RXF13EID0_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID0_MASK                           0x1
#define _RXF13EIDL_RXF13EID1_POSN                           0x1
#define _RXF13EIDL_RXF13EID1_POSITION                       0x1
#define _RXF13EIDL_RXF13EID1_SIZE                           0x1
#define _RXF13EIDL_RXF13EID1_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID1_MASK                           0x2
#define _RXF13EIDL_RXF13EID2_POSN                           0x2
#define _RXF13EIDL_RXF13EID2_POSITION                       0x2
#define _RXF13EIDL_RXF13EID2_SIZE                           0x1
#define _RXF13EIDL_RXF13EID2_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID2_MASK                           0x4
#define _RXF13EIDL_RXF13EID3_POSN                           0x3
#define _RXF13EIDL_RXF13EID3_POSITION                       0x3
#define _RXF13EIDL_RXF13EID3_SIZE                           0x1
#define _RXF13EIDL_RXF13EID3_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID3_MASK                           0x8
#define _RXF13EIDL_RXF13EID4_POSN                           0x4
#define _RXF13EIDL_RXF13EID4_POSITION                       0x4
#define _RXF13EIDL_RXF13EID4_SIZE                           0x1
#define _RXF13EIDL_RXF13EID4_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID4_MASK                           0x10
#define _RXF13EIDL_RXF13EID5_POSN                           0x5
#define _RXF13EIDL_RXF13EID5_POSITION                       0x5
#define _RXF13EIDL_RXF13EID5_SIZE                           0x1
#define _RXF13EIDL_RXF13EID5_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID5_MASK                           0x20
#define _RXF13EIDL_RXF13EID6_POSN                           0x6
#define _RXF13EIDL_RXF13EID6_POSITION                       0x6
#define _RXF13EIDL_RXF13EID6_SIZE                           0x1
#define _RXF13EIDL_RXF13EID6_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID6_MASK                           0x40
#define _RXF13EIDL_RXF13EID7_POSN                           0x7
#define _RXF13EIDL_RXF13EID7_POSITION                       0x7
#define _RXF13EIDL_RXF13EID7_SIZE                           0x1
#define _RXF13EIDL_RXF13EID7_LENGTH                         0x1
#define _RXF13EIDL_RXF13EID7_MASK                           0x80

// Register: RXF14SIDH
#define RXF14SIDH RXF14SIDH
extern volatile unsigned char           RXF14SIDH           __at(0xE68);
#ifndef _LIB_BUILD
asm("RXF14SIDH equ 0E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF14SID3              :1;
        unsigned RXF14SID4              :1;
        unsigned RXF14SID5              :1;
        unsigned RXF14SID6              :1;
        unsigned RXF14SID7              :1;
        unsigned RXF14SID8              :1;
        unsigned RXF14SID9              :1;
        unsigned RXF14SID10             :1;
    };
} RXF14SIDHbits_t;
