MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile B5EIDHbits_t B5EIDHbits __at(0xED3);
// bitfield macros
#define _B5EIDH_EID_POSN                                    0x0
#define _B5EIDH_EID_POSITION                                0x0
#define _B5EIDH_EID_SIZE                                    0x8
#define _B5EIDH_EID_LENGTH                                  0x8
#define _B5EIDH_EID_MASK                                    0xFF
#define _B5EIDH_EID8_POSN                                   0x0
#define _B5EIDH_EID8_POSITION                               0x0
#define _B5EIDH_EID8_SIZE                                   0x1
#define _B5EIDH_EID8_LENGTH                                 0x1
#define _B5EIDH_EID8_MASK                                   0x1
#define _B5EIDH_EID9_POSN                                   0x1
#define _B5EIDH_EID9_POSITION                               0x1
#define _B5EIDH_EID9_SIZE                                   0x1
#define _B5EIDH_EID9_LENGTH                                 0x1
#define _B5EIDH_EID9_MASK                                   0x2
#define _B5EIDH_EID10_POSN                                  0x2
#define _B5EIDH_EID10_POSITION                              0x2
#define _B5EIDH_EID10_SIZE                                  0x1
#define _B5EIDH_EID10_LENGTH                                0x1
#define _B5EIDH_EID10_MASK                                  0x4
#define _B5EIDH_EID11_POSN                                  0x3
#define _B5EIDH_EID11_POSITION                              0x3
#define _B5EIDH_EID11_SIZE                                  0x1
#define _B5EIDH_EID11_LENGTH                                0x1
#define _B5EIDH_EID11_MASK                                  0x8
#define _B5EIDH_EID12_POSN                                  0x4
#define _B5EIDH_EID12_POSITION                              0x4
#define _B5EIDH_EID12_SIZE                                  0x1
#define _B5EIDH_EID12_LENGTH                                0x1
#define _B5EIDH_EID12_MASK                                  0x10
#define _B5EIDH_EID13_POSN                                  0x5
#define _B5EIDH_EID13_POSITION                              0x5
#define _B5EIDH_EID13_SIZE                                  0x1
#define _B5EIDH_EID13_LENGTH                                0x1
#define _B5EIDH_EID13_MASK                                  0x20
#define _B5EIDH_EID14_POSN                                  0x6
#define _B5EIDH_EID14_POSITION                              0x6
#define _B5EIDH_EID14_SIZE                                  0x1
#define _B5EIDH_EID14_LENGTH                                0x1
#define _B5EIDH_EID14_MASK                                  0x40
#define _B5EIDH_EID15_POSN                                  0x7
#define _B5EIDH_EID15_POSITION                              0x7
#define _B5EIDH_EID15_SIZE                                  0x1
#define _B5EIDH_EID15_LENGTH                                0x1
#define _B5EIDH_EID15_MASK                                  0x80
#define _B5EIDH_B5EID8_POSN                                 0x0
#define _B5EIDH_B5EID8_POSITION                             0x0
#define _B5EIDH_B5EID8_SIZE                                 0x1
#define _B5EIDH_B5EID8_LENGTH                               0x1
#define _B5EIDH_B5EID8_MASK                                 0x1
#define _B5EIDH_B5EID9_POSN                                 0x1
#define _B5EIDH_B5EID9_POSITION                             0x1
#define _B5EIDH_B5EID9_SIZE                                 0x1
#define _B5EIDH_B5EID9_LENGTH                               0x1
#define _B5EIDH_B5EID9_MASK                                 0x2
#define _B5EIDH_B5EID10_POSN                                0x2
#define _B5EIDH_B5EID10_POSITION                            0x2
#define _B5EIDH_B5EID10_SIZE                                0x1
#define _B5EIDH_B5EID10_LENGTH                              0x1
#define _B5EIDH_B5EID10_MASK                                0x4
#define _B5EIDH_B5EID11_POSN                                0x3
#define _B5EIDH_B5EID11_POSITION                            0x3
#define _B5EIDH_B5EID11_SIZE                                0x1
#define _B5EIDH_B5EID11_LENGTH                              0x1
#define _B5EIDH_B5EID11_MASK                                0x8
#define _B5EIDH_B5EID12_POSN                                0x4
#define _B5EIDH_B5EID12_POSITION                            0x4
#define _B5EIDH_B5EID12_SIZE                                0x1
#define _B5EIDH_B5EID12_LENGTH                              0x1
#define _B5EIDH_B5EID12_MASK                                0x10
#define _B5EIDH_B5EID13_POSN                                0x5
#define _B5EIDH_B5EID13_POSITION                            0x5
#define _B5EIDH_B5EID13_SIZE                                0x1
#define _B5EIDH_B5EID13_LENGTH                              0x1
#define _B5EIDH_B5EID13_MASK                                0x20
#define _B5EIDH_B5EID14_POSN                                0x6
#define _B5EIDH_B5EID14_POSITION                            0x6
#define _B5EIDH_B5EID14_SIZE                                0x1
#define _B5EIDH_B5EID14_LENGTH                              0x1
#define _B5EIDH_B5EID14_MASK                                0x40
#define _B5EIDH_B5EID15_POSN                                0x7
#define _B5EIDH_B5EID15_POSITION                            0x7
#define _B5EIDH_B5EID15_SIZE                                0x1
#define _B5EIDH_B5EID15_LENGTH                              0x1
#define _B5EIDH_B5EID15_MASK                                0x80

// Register: B5EIDL
#define B5EIDL B5EIDL
extern volatile unsigned char           B5EIDL              __at(0xED4);
#ifndef _LIB_BUILD
asm("B5EIDL equ 0ED4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B5EID0                 :1;
        unsigned B5EID1                 :1;
        unsigned B5EID2                 :1;
        unsigned B5EID3                 :1;
        unsigned B5EID4                 :1;
        unsigned B5EID5                 :1;
        unsigned B5EID6                 :1;
        unsigned B5EID7                 :1;
    };
} B5EIDLbits_t;
extern volatile B5EIDLbits_t B5EIDLbits __at(0xED4);
// bitfield macros
#define _B5EIDL_EID_POSN                                    0x0
#define _B5EIDL_EID_POSITION                                0x0
#define _B5EIDL_EID_SIZE                                    0x8
#define _B5EIDL_EID_LENGTH                                  0x8
#define _B5EIDL_EID_MASK                                    0xFF
#define _B5EIDL_EID0_POSN                                   0x0
#define _B5EIDL_EID0_POSITION                               0x0
#define _B5EIDL_EID0_SIZE                                   0x1
#define _B5EIDL_EID0_LENGTH                                 0x1
#define _B5EIDL_EID0_MASK                                   0x1
#define _B5EIDL_EID1_POSN                                   0x1
#define _B5EIDL_EID1_POSITION                               0x1
#define _B5EIDL_EID1_SIZE                                   0x1
#define _B5EIDL_EID1_LENGTH                                 0x1
#define _B5EIDL_EID1_MASK                                   0x2
#define _B5EIDL_EID2_POSN                                   0x2
#define _B5EIDL_EID2_POSITION                               0x2
#define _B5EIDL_EID2_SIZE                                   0x1
#define _B5EIDL_EID2_LENGTH                                 0x1
#define _B5EIDL_EID2_MASK                                   0x4
#define _B5EIDL_EID3_POSN                                   0x3
#define _B5EIDL_EID3_POSITION                               0x3
#define _B5EIDL_EID3_SIZE                                   0x1
#define _B5EIDL_EID3_LENGTH                                 0x1
#define _B5EIDL_EID3_MASK                                   0x8
#define _B5EIDL_EID4_POSN                                   0x4
#define _B5EIDL_EID4_POSITION                               0x4
#define _B5EIDL_EID4_SIZE                                   0x1
#define _B5EIDL_EID4_LENGTH                                 0x1
#define _B5EIDL_EID4_MASK                                   0x10
#define _B5EIDL_EID5_POSN                                   0x5
#define _B5EIDL_EID5_POSITION                               0x5
#define _B5EIDL_EID5_SIZE                                   0x1
#define _B5EIDL_EID5_LENGTH                                 0x1
#define _B5EIDL_EID5_MASK                                   0x20
#define _B5EIDL_EID6_POSN                                   0x6
#define _B5EIDL_EID6_POSITION                               0x6
#define _B5EIDL_EID6_SIZE                                   0x1
#define _B5EIDL_EID6_LENGTH                                 0x1
#define _B5EIDL_EID6_MASK                                   0x40
#define _B5EIDL_EID7_POSN                                   0x7
#define _B5EIDL_EID7_POSITION                               0x7
#define _B5EIDL_EID7_SIZE                                   0x1
#define _B5EIDL_EID7_LENGTH                                 0x1
#define _B5EIDL_EID7_MASK                                   0x80
#define _B5EIDL_B5EID0_POSN                                 0x0
#define _B5EIDL_B5EID0_POSITION                             0x0
#define _B5EIDL_B5EID0_SIZE                                 0x1
#define _B5EIDL_B5EID0_LENGTH                               0x1
#define _B5EIDL_B5EID0_MASK                                 0x1
#define _B5EIDL_B5EID1_POSN                                 0x1
#define _B5EIDL_B5EID1_POSITION                             0x1
#define _B5EIDL_B5EID1_SIZE                                 0x1
#define _B5EIDL_B5EID1_LENGTH                               0x1
#define _B5EIDL_B5EID1_MASK                                 0x2
#define _B5EIDL_B5EID2_POSN                                 0x2
#define _B5EIDL_B5EID2_POSITION                             0x2
#define _B5EIDL_B5EID2_SIZE                                 0x1
#define _B5EIDL_B5EID2_LENGTH                               0x1
#define _B5EIDL_B5EID2_MASK                                 0x4
#define _B5EIDL_B5EID3_POSN                                 0x3
#define _B5EIDL_B5EID3_POSITION                             0x3
#define _B5EIDL_B5EID3_SIZE                                 0x1
#define _B5EIDL_B5EID3_LENGTH                               0x1
#define _B5EIDL_B5EID3_MASK                                 0x8
#define _B5EIDL_B5EID4_POSN                                 0x4
#define _B5EIDL_B5EID4_POSITION                             0x4
#define _B5EIDL_B5EID4_SIZE                                 0x1
#define _B5EIDL_B5EID4_LENGTH                               0x1
#define _B5EIDL_B5EID4_MASK                                 0x10
#define _B5EIDL_B5EID5_POSN                                 0x5
#define _B5EIDL_B5EID5_POSITION                             0x5
#define _B5EIDL_B5EID5_SIZE                                 0x1
#define _B5EIDL_B5EID5_LENGTH                               0x1
#define _B5EIDL_B5EID5_MASK                                 0x20
#define _B5EIDL_B5EID6_POSN                                 0x6
#define _B5EIDL_B5EID6_POSITION                             0x6
#define _B5EIDL_B5EID6_SIZE                                 0x1
#define _B5EIDL_B5EID6_LENGTH                               0x1
#define _B5EIDL_B5EID6_MASK                                 0x40
#define _B5EIDL_B5EID7_POSN                                 0x7
#define _B5EIDL_B5EID7_POSITION                             0x7
#define _B5EIDL_B5EID7_SIZE                                 0x1
#define _B5EIDL_B5EID7_LENGTH                               0x1
#define _B5EIDL_B5EID7_MASK                                 0x80

// Register: B5DLC
#define B5DLC B5DLC
extern volatile unsigned char           B5DLC               __at(0xED5);
#ifndef _LIB_BUILD
asm("B5DLC equ 0ED5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B5DLC0                 :1;
        unsigned B5DLC1                 :1;
        unsigned B5DLC2                 :1;
        unsigned B5DLC3                 :1;
        unsigned B5RB0                  :1;
        unsigned B5RB1                  :1;
        unsigned B5RXRTR                :1;
    };
} B5DLCbits_t;
extern volatile B5DLCbits_t B5DLCbits __at(0xED5);
// bitfield macros
#define _B5DLC_DLC_POSN                                     0x0
#define _B5DLC_DLC_POSITION                                 0x0
#define _B5DLC_DLC_SIZE                                     0x4
#define _B5DLC_DLC_LENGTH                                   0x4
#define _B5DLC_DLC_MASK                                     0xF
#define _B5DLC_RB_POSN                                      0x4
#define _B5DLC_RB_POSITION                                  0x4
#define _B5DLC_RB_SIZE                                      0x2
#define _B5DLC_RB_LENGTH                                    0x2
#define _B5DLC_RB_MASK                                      0x30
#define _B5DLC_RXRTR_TXRTR_POSN                             0x6
#define _B5DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B5DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B5DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B5DLC_RXRTR_TXRTR_MASK                             0x40
#define _B5DLC_DLC0_POSN                                    0x0
#define _B5DLC_DLC0_POSITION                                0x0
#define _B5DLC_DLC0_SIZE                                    0x1
#define _B5DLC_DLC0_LENGTH                                  0x1
#define _B5DLC_DLC0_MASK                                    0x1
#define _B5DLC_DLC1_POSN                                    0x1
#define _B5DLC_DLC1_POSITION                                0x1
#define _B5DLC_DLC1_SIZE                                    0x1
#define _B5DLC_DLC1_LENGTH                                  0x1
#define _B5DLC_DLC1_MASK                                    0x2
#define _B5DLC_DLC2_POSN                                    0x2
#define _B5DLC_DLC2_POSITION                                0x2
#define _B5DLC_DLC2_SIZE                                    0x1
#define _B5DLC_DLC2_LENGTH                                  0x1
#define _B5DLC_DLC2_MASK                                    0x4
#define _B5DLC_DLC3_POSN                                    0x3
#define _B5DLC_DLC3_POSITION                                0x3
#define _B5DLC_DLC3_SIZE                                    0x1
#define _B5DLC_DLC3_LENGTH                                  0x1
#define _B5DLC_DLC3_MASK                                    0x8
#define _B5DLC_RB0_POSN                                     0x4
#define _B5DLC_RB0_POSITION                                 0x4
#define _B5DLC_RB0_SIZE                                     0x1
#define _B5DLC_RB0_LENGTH                                   0x1
#define _B5DLC_RB0_MASK                                     0x10
#define _B5DLC_RB1_POSN                                     0x5
#define _B5DLC_RB1_POSITION                                 0x5
#define _B5DLC_RB1_SIZE                                     0x1
#define _B5DLC_RB1_LENGTH                                   0x1
#define _B5DLC_RB1_MASK                                     0x20
#define _B5DLC_RXRTR_POSN                                   0x6
#define _B5DLC_RXRTR_POSITION                               0x6
#define _B5DLC_RXRTR_SIZE                                   0x1
#define _B5DLC_RXRTR_LENGTH                                 0x1
#define _B5DLC_RXRTR_MASK                                   0x40
#define _B5DLC_TXRTR_POSN                                   0x6
#define _B5DLC_TXRTR_POSITION                               0x6
#define _B5DLC_TXRTR_SIZE                                   0x1
#define _B5DLC_TXRTR_LENGTH                                 0x1
#define _B5DLC_TXRTR_MASK                                   0x40
#define _B5DLC_B5DLC0_POSN                                  0x0
#define _B5DLC_B5DLC0_POSITION                              0x0
#define _B5DLC_B5DLC0_SIZE                                  0x1
#define _B5DLC_B5DLC0_LENGTH                                0x1
#define _B5DLC_B5DLC0_MASK                                  0x1
#define _B5DLC_B5DLC1_POSN                                  0x1
#define _B5DLC_B5DLC1_POSITION                              0x1
#define _B5DLC_B5DLC1_SIZE                                  0x1
#define _B5DLC_B5DLC1_LENGTH                                0x1
#define _B5DLC_B5DLC1_MASK                                  0x2
#define _B5DLC_B5DLC2_POSN                                  0x2
#define _B5DLC_B5DLC2_POSITION                              0x2
#define _B5DLC_B5DLC2_SIZE                                  0x1
#define _B5DLC_B5DLC2_LENGTH                                0x1
#define _B5DLC_B5DLC2_MASK                                  0x4
#define _B5DLC_B5DLC3_POSN                                  0x3
#define _B5DLC_B5DLC3_POSITION                              0x3
#define _B5DLC_B5DLC3_SIZE                                  0x1
#define _B5DLC_B5DLC3_LENGTH                                0x1
#define _B5DLC_B5DLC3_MASK                                  0x8
#define _B5DLC_B5RB0_POSN                                   0x4
#define _B5DLC_B5RB0_POSITION                               0x4
#define _B5DLC_B5RB0_SIZE                                   0x1
#define _B5DLC_B5RB0_LENGTH                                 0x1
#define _B5DLC_B5RB0_MASK                                   0x10
#define _B5DLC_B5RB1_POSN                                   0x5
#define _B5DLC_B5RB1_POSITION                               0x5
#define _B5DLC_B5RB1_SIZE                                   0x1
#define _B5DLC_B5RB1_LENGTH                                 0x1
#define _B5DLC_B5RB1_MASK                                   0x20
#define _B5DLC_B5RXRTR_POSN                                 0x6
#define _B5DLC_B5RXRTR_POSITION                             0x6
#define _B5DLC_B5RXRTR_SIZE                                 0x1
#define _B5DLC_B5RXRTR_LENGTH                               0x1
#define _B5DLC_B5RXRTR_MASK                                 0x40

