MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile RXF1SIDLbits_t RXF1SIDLbits __at(0xEE5);
// bitfield macros
#define _RXF1SIDL_EID_POSN                                  0x0
#define _RXF1SIDL_EID_POSITION                              0x0
#define _RXF1SIDL_EID_SIZE                                  0x2
#define _RXF1SIDL_EID_LENGTH                                0x2
#define _RXF1SIDL_EID_MASK                                  0x3
#define _RXF1SIDL_EXIDEN_POSN                               0x3
#define _RXF1SIDL_EXIDEN_POSITION                           0x3
#define _RXF1SIDL_EXIDEN_SIZE                               0x1
#define _RXF1SIDL_EXIDEN_LENGTH                             0x1
#define _RXF1SIDL_EXIDEN_MASK                               0x8
#define _RXF1SIDL_SID_POSN                                  0x5
#define _RXF1SIDL_SID_POSITION                              0x5
#define _RXF1SIDL_SID_SIZE                                  0x3
#define _RXF1SIDL_SID_LENGTH                                0x3
#define _RXF1SIDL_SID_MASK                                  0xE0
#define _RXF1SIDL_EID16_POSN                                0x0
#define _RXF1SIDL_EID16_POSITION                            0x0
#define _RXF1SIDL_EID16_SIZE                                0x1
#define _RXF1SIDL_EID16_LENGTH                              0x1
#define _RXF1SIDL_EID16_MASK                                0x1
#define _RXF1SIDL_EID17_POSN                                0x1
#define _RXF1SIDL_EID17_POSITION                            0x1
#define _RXF1SIDL_EID17_SIZE                                0x1
#define _RXF1SIDL_EID17_LENGTH                              0x1
#define _RXF1SIDL_EID17_MASK                                0x2
#define _RXF1SIDL_SID0_POSN                                 0x5
#define _RXF1SIDL_SID0_POSITION                             0x5
#define _RXF1SIDL_SID0_SIZE                                 0x1
#define _RXF1SIDL_SID0_LENGTH                               0x1
#define _RXF1SIDL_SID0_MASK                                 0x20
#define _RXF1SIDL_SID1_POSN                                 0x6
#define _RXF1SIDL_SID1_POSITION                             0x6
#define _RXF1SIDL_SID1_SIZE                                 0x1
#define _RXF1SIDL_SID1_LENGTH                               0x1
#define _RXF1SIDL_SID1_MASK                                 0x40
#define _RXF1SIDL_SID2_POSN                                 0x7
#define _RXF1SIDL_SID2_POSITION                             0x7
#define _RXF1SIDL_SID2_SIZE                                 0x1
#define _RXF1SIDL_SID2_LENGTH                               0x1
#define _RXF1SIDL_SID2_MASK                                 0x80
#define _RXF1SIDL_RXF1EID16_POSN                            0x0
#define _RXF1SIDL_RXF1EID16_POSITION                        0x0
#define _RXF1SIDL_RXF1EID16_SIZE                            0x1
#define _RXF1SIDL_RXF1EID16_LENGTH                          0x1
#define _RXF1SIDL_RXF1EID16_MASK                            0x1
#define _RXF1SIDL_RXF1EID17_POSN                            0x1
#define _RXF1SIDL_RXF1EID17_POSITION                        0x1
#define _RXF1SIDL_RXF1EID17_SIZE                            0x1
#define _RXF1SIDL_RXF1EID17_LENGTH                          0x1
#define _RXF1SIDL_RXF1EID17_MASK                            0x2
#define _RXF1SIDL_RXF1EXIDEN_POSN                           0x3
#define _RXF1SIDL_RXF1EXIDEN_POSITION                       0x3
#define _RXF1SIDL_RXF1EXIDEN_SIZE                           0x1
#define _RXF1SIDL_RXF1EXIDEN_LENGTH                         0x1
#define _RXF1SIDL_RXF1EXIDEN_MASK                           0x8
#define _RXF1SIDL_RXF1SID0_POSN                             0x5
#define _RXF1SIDL_RXF1SID0_POSITION                         0x5
#define _RXF1SIDL_RXF1SID0_SIZE                             0x1
#define _RXF1SIDL_RXF1SID0_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID0_MASK                             0x20
#define _RXF1SIDL_RXF1SID1_POSN                             0x6
#define _RXF1SIDL_RXF1SID1_POSITION                         0x6
#define _RXF1SIDL_RXF1SID1_SIZE                             0x1
#define _RXF1SIDL_RXF1SID1_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID1_MASK                             0x40
#define _RXF1SIDL_RXF1SID2_POSN                             0x7
#define _RXF1SIDL_RXF1SID2_POSITION                         0x7
#define _RXF1SIDL_RXF1SID2_SIZE                             0x1
#define _RXF1SIDL_RXF1SID2_LENGTH                           0x1
#define _RXF1SIDL_RXF1SID2_MASK                             0x80

// Register: RXF1EIDH
#define RXF1EIDH RXF1EIDH
extern volatile unsigned char           RXF1EIDH            __at(0xEE6);
#ifndef _LIB_BUILD
asm("RXF1EIDH equ 0EE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF1EID8               :1;
        unsigned RXF1EID9               :1;
        unsigned RXF1EID10              :1;
        unsigned RXF1EID11              :1;
        unsigned RXF1EID12              :1;
        unsigned RXF1EID13              :1;
        unsigned RXF1EID14              :1;
        unsigned RXF1EID15              :1;
    };
} RXF1EIDHbits_t;
extern volatile RXF1EIDHbits_t RXF1EIDHbits __at(0xEE6);
// bitfield macros
#define _RXF1EIDH_EID_POSN                                  0x0
#define _RXF1EIDH_EID_POSITION                              0x0
#define _RXF1EIDH_EID_SIZE                                  0x8
#define _RXF1EIDH_EID_LENGTH                                0x8
#define _RXF1EIDH_EID_MASK                                  0xFF
#define _RXF1EIDH_EID8_POSN                                 0x0
#define _RXF1EIDH_EID8_POSITION                             0x0
#define _RXF1EIDH_EID8_SIZE                                 0x1
#define _RXF1EIDH_EID8_LENGTH                               0x1
#define _RXF1EIDH_EID8_MASK                                 0x1
#define _RXF1EIDH_EID9_POSN                                 0x1
#define _RXF1EIDH_EID9_POSITION                             0x1
#define _RXF1EIDH_EID9_SIZE                                 0x1
#define _RXF1EIDH_EID9_LENGTH                               0x1
#define _RXF1EIDH_EID9_MASK                                 0x2
#define _RXF1EIDH_EID10_POSN                                0x2
#define _RXF1EIDH_EID10_POSITION                            0x2
#define _RXF1EIDH_EID10_SIZE                                0x1
#define _RXF1EIDH_EID10_LENGTH                              0x1
#define _RXF1EIDH_EID10_MASK                                0x4
#define _RXF1EIDH_EID11_POSN                                0x3
#define _RXF1EIDH_EID11_POSITION                            0x3
#define _RXF1EIDH_EID11_SIZE                                0x1
#define _RXF1EIDH_EID11_LENGTH                              0x1
#define _RXF1EIDH_EID11_MASK                                0x8
#define _RXF1EIDH_EID12_POSN                                0x4
#define _RXF1EIDH_EID12_POSITION                            0x4
#define _RXF1EIDH_EID12_SIZE                                0x1
#define _RXF1EIDH_EID12_LENGTH                              0x1
#define _RXF1EIDH_EID12_MASK                                0x10
#define _RXF1EIDH_EID13_POSN                                0x5
#define _RXF1EIDH_EID13_POSITION                            0x5
#define _RXF1EIDH_EID13_SIZE                                0x1
#define _RXF1EIDH_EID13_LENGTH                              0x1
#define _RXF1EIDH_EID13_MASK                                0x20
#define _RXF1EIDH_EID14_POSN                                0x6
#define _RXF1EIDH_EID14_POSITION                            0x6
#define _RXF1EIDH_EID14_SIZE                                0x1
#define _RXF1EIDH_EID14_LENGTH                              0x1
#define _RXF1EIDH_EID14_MASK                                0x40
#define _RXF1EIDH_EID15_POSN                                0x7
#define _RXF1EIDH_EID15_POSITION                            0x7
#define _RXF1EIDH_EID15_SIZE                                0x1
#define _RXF1EIDH_EID15_LENGTH                              0x1
#define _RXF1EIDH_EID15_MASK                                0x80
#define _RXF1EIDH_RXF1EID8_POSN                             0x0
#define _RXF1EIDH_RXF1EID8_POSITION                         0x0
#define _RXF1EIDH_RXF1EID8_SIZE                             0x1
#define _RXF1EIDH_RXF1EID8_LENGTH                           0x1
#define _RXF1EIDH_RXF1EID8_MASK                             0x1
#define _RXF1EIDH_RXF1EID9_POSN                             0x1
#define _RXF1EIDH_RXF1EID9_POSITION                         0x1
#define _RXF1EIDH_RXF1EID9_SIZE                             0x1
#define _RXF1EIDH_RXF1EID9_LENGTH                           0x1
#define _RXF1EIDH_RXF1EID9_MASK                             0x2
#define _RXF1EIDH_RXF1EID10_POSN                            0x2
#define _RXF1EIDH_RXF1EID10_POSITION                        0x2
#define _RXF1EIDH_RXF1EID10_SIZE                            0x1
#define _RXF1EIDH_RXF1EID10_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID10_MASK                            0x4
#define _RXF1EIDH_RXF1EID11_POSN                            0x3
#define _RXF1EIDH_RXF1EID11_POSITION                        0x3
#define _RXF1EIDH_RXF1EID11_SIZE                            0x1
#define _RXF1EIDH_RXF1EID11_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID11_MASK                            0x8
#define _RXF1EIDH_RXF1EID12_POSN                            0x4
#define _RXF1EIDH_RXF1EID12_POSITION                        0x4
#define _RXF1EIDH_RXF1EID12_SIZE                            0x1
#define _RXF1EIDH_RXF1EID12_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID12_MASK                            0x10
#define _RXF1EIDH_RXF1EID13_POSN                            0x5
#define _RXF1EIDH_RXF1EID13_POSITION                        0x5
#define _RXF1EIDH_RXF1EID13_SIZE                            0x1
#define _RXF1EIDH_RXF1EID13_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID13_MASK                            0x20
#define _RXF1EIDH_RXF1EID14_POSN                            0x6
#define _RXF1EIDH_RXF1EID14_POSITION                        0x6
#define _RXF1EIDH_RXF1EID14_SIZE                            0x1
#define _RXF1EIDH_RXF1EID14_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID14_MASK                            0x40
#define _RXF1EIDH_RXF1EID15_POSN                            0x7
#define _RXF1EIDH_RXF1EID15_POSITION                        0x7
#define _RXF1EIDH_RXF1EID15_SIZE                            0x1
#define _RXF1EIDH_RXF1EID15_LENGTH                          0x1
#define _RXF1EIDH_RXF1EID15_MASK                            0x80

// Register: RXF1EIDL
#define RXF1EIDL RXF1EIDL
extern volatile unsigned char           RXF1EIDL            __at(0xEE7);
#ifndef _LIB_BUILD
asm("RXF1EIDL equ 0EE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF1EID0               :1;
        unsigned RXF1EID1               :1;
        unsigned RXF1EID2               :1;
        unsigned RXF1EID3               :1;
        unsigned RXF1EID4               :1;
        unsigned RXF1EID5               :1;
        unsigned RXF1EID6               :1;
        unsigned RXF1EID7               :1;
    };
} RXF1EIDLbits_t;
