MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xF59);
#ifndef _LIB_BUILD
asm("PMD0 equ 0F59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPMD                  :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0xF59);
// bitfield macros
#define _PMD0_SSPMD_POSN                                    0x0
#define _PMD0_SSPMD_POSITION                                0x0
#define _PMD0_SSPMD_SIZE                                    0x1
#define _PMD0_SSPMD_LENGTH                                  0x1
#define _PMD0_SSPMD_MASK                                    0x1
#define _PMD0_UART1MD_POSN                                  0x1
#define _PMD0_UART1MD_POSITION                              0x1
#define _PMD0_UART1MD_SIZE                                  0x1
#define _PMD0_UART1MD_LENGTH                                0x1
#define _PMD0_UART1MD_MASK                                  0x2
#define _PMD0_UART2MD_POSN                                  0x2
#define _PMD0_UART2MD_POSITION                              0x2
#define _PMD0_UART2MD_SIZE                                  0x1
#define _PMD0_UART2MD_LENGTH                                0x1
#define _PMD0_UART2MD_MASK                                  0x4
#define _PMD0_CCP1MD_POSN                                   0x3
#define _PMD0_CCP1MD_POSITION                               0x3
#define _PMD0_CCP1MD_SIZE                                   0x1
#define _PMD0_CCP1MD_LENGTH                                 0x1
#define _PMD0_CCP1MD_MASK                                   0x8
#define _PMD0_CCP2MD_POSN                                   0x4
#define _PMD0_CCP2MD_POSITION                               0x4
#define _PMD0_CCP2MD_SIZE                                   0x1
#define _PMD0_CCP2MD_LENGTH                                 0x1
#define _PMD0_CCP2MD_MASK                                   0x10
#define _PMD0_CCP3MD_POSN                                   0x5
#define _PMD0_CCP3MD_POSITION                               0x5
#define _PMD0_CCP3MD_SIZE                                   0x1
#define _PMD0_CCP3MD_LENGTH                                 0x1
#define _PMD0_CCP3MD_MASK                                   0x20
#define _PMD0_CCP4MD_POSN                                   0x6
#define _PMD0_CCP4MD_POSITION                               0x6
#define _PMD0_CCP4MD_SIZE                                   0x1
#define _PMD0_CCP4MD_LENGTH                                 0x1
#define _PMD0_CCP4MD_MASK                                   0x40
#define _PMD0_CCP5MD_POSN                                   0x7
#define _PMD0_CCP5MD_POSITION                               0x7
#define _PMD0_CCP5MD_SIZE                                   0x1
#define _PMD0_CCP5MD_LENGTH                                 0x1
#define _PMD0_CCP5MD_MASK                                   0x80
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0xF5A);
#ifndef _LIB_BUILD
asm("IOCB equ 0F5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0xF5A);
// bitfield macros
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80

// Register: WPUB
#define WPUB WPUB
extern volatile unsigned char           WPUB                __at(0xF5B);
#ifndef _LIB_BUILD
asm("WPUB equ 0F5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUB0                  :1;
        unsigned WPUB1                  :1;
        unsigned WPUB2                  :1;
        unsigned WPUB3                  :1;
        unsigned WPUB4                  :1;
        unsigned WPUB5                  :1;
        unsigned WPUB6                  :1;
        unsigned WPUB7                  :1;
    };
} WPUBbits_t;
