MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile __bit                   B0EID2              __at(0x7422);	// @ (0xE84 * 8 + 2)
#define                                 B0EID2_bit          _BIT_ACCESS(B0EIDL,2)
// B0EIDL<B0EID3>
extern volatile __bit                   B0EID3              __at(0x7423);	// @ (0xE84 * 8 + 3)
#define                                 B0EID3_bit          _BIT_ACCESS(B0EIDL,3)
// B0EIDL<B0EID4>
extern volatile __bit                   B0EID4              __at(0x7424);	// @ (0xE84 * 8 + 4)
#define                                 B0EID4_bit          _BIT_ACCESS(B0EIDL,4)
// B0EIDL<B0EID5>
extern volatile __bit                   B0EID5              __at(0x7425);	// @ (0xE84 * 8 + 5)
#define                                 B0EID5_bit          _BIT_ACCESS(B0EIDL,5)
// B0EIDL<B0EID6>
extern volatile __bit                   B0EID6              __at(0x7426);	// @ (0xE84 * 8 + 6)
#define                                 B0EID6_bit          _BIT_ACCESS(B0EIDL,6)
// B0EIDL<B0EID7>
extern volatile __bit                   B0EID7              __at(0x7427);	// @ (0xE84 * 8 + 7)
#define                                 B0EID7_bit          _BIT_ACCESS(B0EIDL,7)
// B0EIDH<B0EID8>
extern volatile __bit                   B0EID8              __at(0x7418);	// @ (0xE83 * 8 + 0)
#define                                 B0EID8_bit          _BIT_ACCESS(B0EIDH,0)
// B0EIDH<B0EID9>
extern volatile __bit                   B0EID9              __at(0x7419);	// @ (0xE83 * 8 + 1)
#define                                 B0EID9_bit          _BIT_ACCESS(B0EIDH,1)
// B0SIDL<B0EXID>
extern volatile __bit                   B0EXID              __at(0x7413);	// @ (0xE82 * 8 + 3)
#define                                 B0EXID_bit          _BIT_ACCESS(B0SIDL,3)
// B0CON<B0FILHIT0>
extern volatile __bit                   B0FILHIT0           __at(0x7400);	// @ (0xE80 * 8 + 0)
#define                                 B0FILHIT0_bit       _BIT_ACCESS(B0CON,0)
// B0CON<B0FILHIT1>
extern volatile __bit                   B0FILHIT1           __at(0x7401);	// @ (0xE80 * 8 + 1)
#define                                 B0FILHIT1_bit       _BIT_ACCESS(B0CON,1)
// B0CON<B0FILHIT2>
extern volatile __bit                   B0FILHIT2           __at(0x7402);	// @ (0xE80 * 8 + 2)
#define                                 B0FILHIT2_bit       _BIT_ACCESS(B0CON,2)
// B0CON<B0FILHIT3>
extern volatile __bit                   B0FILHIT3           __at(0x7403);	// @ (0xE80 * 8 + 3)
#define                                 B0FILHIT3_bit       _BIT_ACCESS(B0CON,3)
// B0CON<B0FILHIT4>
extern volatile __bit                   B0FILHIT4           __at(0x7404);	// @ (0xE80 * 8 + 4)
#define                                 B0FILHIT4_bit       _BIT_ACCESS(B0CON,4)
// BIE0<B0IE>
extern volatile __bit                   B0IE                __at(0x73F2);	// @ (0xE7E * 8 + 2)
#define                                 B0IE_bit            _BIT_ACCESS(BIE0,2)
// B0DLC<B0RB0>
extern volatile __bit                   B0RB0               __at(0x742C);	// @ (0xE85 * 8 + 4)
#define                                 B0RB0_bit           _BIT_ACCESS(B0DLC,4)
// B0DLC<B0RB1>
extern volatile __bit                   B0RB1               __at(0x742D);	// @ (0xE85 * 8 + 5)
#define                                 B0RB1_bit           _BIT_ACCESS(B0DLC,5)
// B0CON<B0RTREN>
extern volatile __bit                   B0RTREN             __at(0x7402);	// @ (0xE80 * 8 + 2)
#define                                 B0RTREN_bit         _BIT_ACCESS(B0CON,2)
// B0CON<B0RTRRO>
extern volatile __bit                   B0RTRRO             __at(0x7405);	// @ (0xE80 * 8 + 5)
#define                                 B0RTRRO_bit         _BIT_ACCESS(B0CON,5)
// B0CON<B0RXFUL>
extern volatile __bit                   B0RXFUL             __at(0x7407);	// @ (0xE80 * 8 + 7)
#define                                 B0RXFUL_bit         _BIT_ACCESS(B0CON,7)
// B0CON<B0RXM1>
extern volatile __bit                   B0RXM1              __at(0x7406);	// @ (0xE80 * 8 + 6)
#define                                 B0RXM1_bit          _BIT_ACCESS(B0CON,6)
// B0DLC<B0RXRTR>
extern volatile __bit                   B0RXRTR             __at(0x742E);	// @ (0xE85 * 8 + 6)
#define                                 B0RXRTR_bit         _BIT_ACCESS(B0DLC,6)
// B0SIDL<B0SID0>
extern volatile __bit                   B0SID0              __at(0x7415);	// @ (0xE82 * 8 + 5)
#define                                 B0SID0_bit          _BIT_ACCESS(B0SIDL,5)
// B0SIDL<B0SID1>
extern volatile __bit                   B0SID1              __at(0x7416);	// @ (0xE82 * 8 + 6)
#define                                 B0SID1_bit          _BIT_ACCESS(B0SIDL,6)
// B0SIDH<B0SID10>
extern volatile __bit                   B0SID10             __at(0x740F);	// @ (0xE81 * 8 + 7)
#define                                 B0SID10_bit         _BIT_ACCESS(B0SIDH,7)
// B0SIDL<B0SID2>
extern volatile __bit                   B0SID2              __at(0x7417);	// @ (0xE82 * 8 + 7)
#define                                 B0SID2_bit          _BIT_ACCESS(B0SIDL,7)
// B0SIDH<B0SID3>
extern volatile __bit                   B0SID3              __at(0x7408);	// @ (0xE81 * 8 + 0)
#define                                 B0SID3_bit          _BIT_ACCESS(B0SIDH,0)
// B0SIDH<B0SID4>
extern volatile __bit                   B0SID4              __at(0x7409);	// @ (0xE81 * 8 + 1)
#define                                 B0SID4_bit          _BIT_ACCESS(B0SIDH,1)
// B0SIDH<B0SID5>
extern volatile __bit                   B0SID5              __at(0x740A);	// @ (0xE81 * 8 + 2)
#define                                 B0SID5_bit          _BIT_ACCESS(B0SIDH,2)
// B0SIDH<B0SID6>
extern volatile __bit                   B0SID6              __at(0x740B);	// @ (0xE81 * 8 + 3)
#define                                 B0SID6_bit          _BIT_ACCESS(B0SIDH,3)
// B0SIDH<B0SID7>
extern volatile __bit                   B0SID7              __at(0x740C);	// @ (0xE81 * 8 + 4)
#define                                 B0SID7_bit          _BIT_ACCESS(B0SIDH,4)
// B0SIDH<B0SID8>
extern volatile __bit                   B0SID8              __at(0x740D);	// @ (0xE81 * 8 + 5)
#define                                 B0SID8_bit          _BIT_ACCESS(B0SIDH,5)
// B0SIDH<B0SID9>
extern volatile __bit                   B0SID9              __at(0x740E);	// @ (0xE81 * 8 + 6)
#define                                 B0SID9_bit          _BIT_ACCESS(B0SIDH,6)
// B0SIDL<B0SRR>
extern volatile __bit                   B0SRR               __at(0x7414);	// @ (0xE82 * 8 + 4)
#define                                 B0SRR_bit           _BIT_ACCESS(B0SIDL,4)
// B0CON<B0TXABT>
extern volatile __bit                   B0TXABT             __at(0x7406);	// @ (0xE80 * 8 + 6)
#define                                 B0TXABT_bit         _BIT_ACCESS(B0CON,6)
// B0CON<B0TXB3IF>
extern volatile __bit                   B0TXB3IF            __at(0x7407);	// @ (0xE80 * 8 + 7)
#define                                 B0TXB3IF_bit        _BIT_ACCESS(B0CON,7)
// BSEL0<B0TXEN>
extern volatile __bit                   B0TXEN              __at(0x73EA);	// @ (0xE7D * 8 + 2)
#define                                 B0TXEN_bit          _BIT_ACCESS(BSEL0,2)
// B0CON<B0TXERR>
extern volatile __bit                   B0TXERR             __at(0x7404);	// @ (0xE80 * 8 + 4)
#define                                 B0TXERR_bit         _BIT_ACCESS(B0CON,4)
// B0CON<B0TXLARB>
extern volatile __bit                   B0TXLARB            __at(0x7405);	// @ (0xE80 * 8 + 5)
#define                                 B0TXLARB_bit        _BIT_ACCESS(B0CON,5)
// B0CON<B0TXPRI0>
extern volatile __bit                   B0TXPRI0            __at(0x7400);	// @ (0xE80 * 8 + 0)
#define                                 B0TXPRI0_bit        _BIT_ACCESS(B0CON,0)
// B0CON<B0TXPRI1>
extern volatile __bit                   B0TXPRI1            __at(0x7401);	// @ (0xE80 * 8 + 1)
#define                                 B0TXPRI1_bit        _BIT_ACCESS(B0CON,1)
// B0CON<B0TXREQ>
extern volatile __bit                   B0TXREQ             __at(0x7403);	// @ (0xE80 * 8 + 3)
#define                                 B0TXREQ_bit         _BIT_ACCESS(B0CON,3)
// B1D0<B1D00>
extern volatile __bit                   B1D00               __at(0x74B0);	// @ (0xE96 * 8 + 0)
#define                                 B1D00_bit           _BIT_ACCESS(B1D0,0)
// B1D0<B1D01>
extern volatile __bit                   B1D01               __at(0x74B1);	// @ (0xE96 * 8 + 1)
#define                                 B1D01_bit           _BIT_ACCESS(B1D0,1)
// B1D0<B1D02>
extern volatile __bit                   B1D02               __at(0x74B2);	// @ (0xE96 * 8 + 2)
#define                                 B1D02_bit           _BIT_ACCESS(B1D0,2)
// B1D0<B1D03>
extern volatile __bit                   B1D03               __at(0x74B3);	// @ (0xE96 * 8 + 3)
#define                                 B1D03_bit           _BIT_ACCESS(B1D0,3)
// B1D0<B1D04>
extern volatile __bit                   B1D04               __at(0x74B4);	// @ (0xE96 * 8 + 4)
#define                                 B1D04_bit           _BIT_ACCESS(B1D0,4)
// B1D0<B1D05>
extern volatile __bit                   B1D05               __at(0x74B5);	// @ (0xE96 * 8 + 5)
#define                                 B1D05_bit           _BIT_ACCESS(B1D0,5)
// B1D0<B1D06>
extern volatile __bit                   B1D06               __at(0x74B6);	// @ (0xE96 * 8 + 6)
#define                                 B1D06_bit           _BIT_ACCESS(B1D0,6)
// B1D0<B1D07>
extern volatile __bit                   B1D07               __at(0x74B7);	// @ (0xE96 * 8 + 7)
#define                                 B1D07_bit           _BIT_ACCESS(B1D0,7)
// B1D1<B1D10>
extern volatile __bit                   B1D10               __at(0x74B8);	// @ (0xE97 * 8 + 0)
#define                                 B1D10_bit           _BIT_ACCESS(B1D1,0)
// B1D1<B1D11>
extern volatile __bit                   B1D11               __at(0x74B9);	// @ (0xE97 * 8 + 1)
#define                                 B1D11_bit           _BIT_ACCESS(B1D1,1)
// B1D1<B1D12>
extern volatile __bit                   B1D12               __at(0x74BA);	// @ (0xE97 * 8 + 2)
#define                                 B1D12_bit           _BIT_ACCESS(B1D1,2)
// B1D1<B1D13>
extern volatile __bit                   B1D13               __at(0x74BB);	// @ (0xE97 * 8 + 3)
#define                                 B1D13_bit           _BIT_ACCESS(B1D1,3)
// B1D1<B1D14>
extern volatile __bit                   B1D14               __at(0x74BC);	// @ (0xE97 * 8 + 4)
#define                                 B1D14_bit           _BIT_ACCESS(B1D1,4)
// B1D1<B1D15>
extern volatile __bit                   B1D15               __at(0x74BD);	// @ (0xE97 * 8 + 5)
#define                                 B1D15_bit           _BIT_ACCESS(B1D1,5)
// B1D1<B1D16>
extern volatile __bit                   B1D16               __at(0x74BE);	// @ (0xE97 * 8 + 6)
#define                                 B1D16_bit           _BIT_ACCESS(B1D1,6)
// B1D1<B1D17>
extern volatile __bit                   B1D17               __at(0x74BF);	// @ (0xE97 * 8 + 7)
#define                                 B1D17_bit           _BIT_ACCESS(B1D1,7)
// B1D2<B1D20>
extern volatile __bit                   B1D20               __at(0x74C0);	// @ (0xE98 * 8 + 0)
#define                                 B1D20_bit           _BIT_ACCESS(B1D2,0)
// B1D2<B1D21>
extern volatile __bit                   B1D21               __at(0x74C1);	// @ (0xE98 * 8 + 1)
#define                                 B1D21_bit           _BIT_ACCESS(B1D2,1)
// B1D2<B1D22>
extern volatile __bit                   B1D22               __at(0x74C2);	// @ (0xE98 * 8 + 2)
#define                                 B1D22_bit           _BIT_ACCESS(B1D2,2)
// B1D2<B1D23>
extern volatile __bit                   B1D23               __at(0x74C3);	// @ (0xE98 * 8 + 3)
#define                                 B1D23_bit           _BIT_ACCESS(B1D2,3)
// B1D2<B1D24>
extern volatile __bit                   B1D24               __at(0x74C4);	// @ (0xE98 * 8 + 4)
#define                                 B1D24_bit           _BIT_ACCESS(B1D2,4)
// B1D2<B1D25>
extern volatile __bit                   B1D25               __at(0x74C5);	// @ (0xE98 * 8 + 5)
#define                                 B1D25_bit           _BIT_ACCESS(B1D2,5)
// B1D2<B1D26>
extern volatile __bit                   B1D26               __at(0x74C6);	// @ (0xE98 * 8 + 6)
#define                                 B1D26_bit           _BIT_ACCESS(B1D2,6)
// B1D2<B1D27>
extern volatile __bit                   B1D27               __at(0x74C7);	// @ (0xE98 * 8 + 7)
#define                                 B1D27_bit           _BIT_ACCESS(B1D2,7)
// B1D3<B1D30>
extern volatile __bit                   B1D30               __at(0x74C8);	// @ (0xE99 * 8 + 0)
#define                                 B1D30_bit           _BIT_ACCESS(B1D3,0)
// B1D3<B1D31>
extern volatile __bit                   B1D31               __at(0x74C9);	// @ (0xE99 * 8 + 1)
#define                                 B1D31_bit           _BIT_ACCESS(B1D3,1)
// B1D3<B1D32>
extern volatile __bit                   B1D32               __at(0x74CA);	// @ (0xE99 * 8 + 2)
#define                                 B1D32_bit           _BIT_ACCESS(B1D3,2)
// B1D3<B1D33>
extern volatile __bit                   B1D33               __at(0x74CB);	// @ (0xE99 * 8 + 3)
#define                                 B1D33_bit           _BIT_ACCESS(B1D3,3)
// B1D3<B1D34>
extern volatile __bit                   B1D34               __at(0x74CC);	// @ (0xE99 * 8 + 4)
#define                                 B1D34_bit           _BIT_ACCESS(B1D3,4)
// B1D3<B1D35>
extern volatile __bit                   B1D35               __at(0x74CD);	// @ (0xE99 * 8 + 5)
#define                                 B1D35_bit           _BIT_ACCESS(B1D3,5)
// B1D3<B1D36>
extern volatile __bit                   B1D36               __at(0x74CE);	// @ (0xE99 * 8 + 6)
#define                                 B1D36_bit           _BIT_ACCESS(B1D3,6)
// B1D3<B1D37>
extern volatile __bit                   B1D37               __at(0x74CF);	// @ (0xE99 * 8 + 7)
#define                                 B1D37_bit           _BIT_ACCESS(B1D3,7)
// B1D4<B1D40>
extern volatile __bit                   B1D40               __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 B1D40_bit           _BIT_ACCESS(B1D4,0)
// B1D4<B1D41>
extern volatile __bit                   B1D41               __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 B1D41_bit           _BIT_ACCESS(B1D4,1)
// B1D4<B1D42>
extern volatile __bit                   B1D42               __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 B1D42_bit           _BIT_ACCESS(B1D4,2)
// B1D4<B1D43>
extern volatile __bit                   B1D43               __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 B1D43_bit           _BIT_ACCESS(B1D4,3)
// B1D4<B1D44>
extern volatile __bit                   B1D44               __at(0x74D4);	// @ (0xE9A * 8 + 4)
#define                                 B1D44_bit           _BIT_ACCESS(B1D4,4)
// B1D4<B1D45>
extern volatile __bit                   B1D45               __at(0x74D5);	// @ (0xE9A * 8 + 5)
#define                                 B1D45_bit           _BIT_ACCESS(B1D4,5)
// B1D4<B1D46>
extern volatile __bit                   B1D46               __at(0x74D6);	// @ (0xE9A * 8 + 6)
#define                                 B1D46_bit           _BIT_ACCESS(B1D4,6)
// B1D4<B1D47>
extern volatile __bit                   B1D47               __at(0x74D7);	// @ (0xE9A * 8 + 7)
#define                                 B1D47_bit           _BIT_ACCESS(B1D4,7)
// B1D5<B1D50>
extern volatile __bit                   B1D50               __at(0x74D8);	// @ (0xE9B * 8 + 0)
#define                                 B1D50_bit           _BIT_ACCESS(B1D5,0)
// B1D5<B1D51>
extern volatile __bit                   B1D51               __at(0x74D9);	// @ (0xE9B * 8 + 1)
#define                                 B1D51_bit           _BIT_ACCESS(B1D5,1)
// B1D5<B1D52>
extern volatile __bit                   B1D52               __at(0x74DA);	// @ (0xE9B * 8 + 2)
#define                                 B1D52_bit           _BIT_ACCESS(B1D5,2)
// B1D5<B1D53>
extern volatile __bit                   B1D53               __at(0x74DB);	// @ (0xE9B * 8 + 3)
#define                                 B1D53_bit           _BIT_ACCESS(B1D5,3)
// B1D5<B1D54>
extern volatile __bit                   B1D54               __at(0x74DC);	// @ (0xE9B * 8 + 4)
#define                                 B1D54_bit           _BIT_ACCESS(B1D5,4)
// B1D5<B1D55>
extern volatile __bit                   B1D55               __at(0x74DD);	// @ (0xE9B * 8 + 5)
#define                                 B1D55_bit           _BIT_ACCESS(B1D5,5)
// B1D5<B1D56>
extern volatile __bit                   B1D56               __at(0x74DE);	// @ (0xE9B * 8 + 6)
#define                                 B1D56_bit           _BIT_ACCESS(B1D5,6)
// B1D5<B1D57>
extern volatile __bit                   B1D57               __at(0x74DF);	// @ (0xE9B * 8 + 7)
#define                                 B1D57_bit           _BIT_ACCESS(B1D5,7)
// B1D6<B1D60>
extern volatile __bit                   B1D60               __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 B1D60_bit           _BIT_ACCESS(B1D6,0)
// B1D6<B1D61>
extern volatile __bit                   B1D61               __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 B1D61_bit           _BIT_ACCESS(B1D6,1)
// B1D6<B1D62>
extern volatile __bit                   B1D62               __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 B1D62_bit           _BIT_ACCESS(B1D6,2)
// B1D6<B1D63>
extern volatile __bit                   B1D63               __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 B1D63_bit           _BIT_ACCESS(B1D6,3)
// B1D6<B1D64>
extern volatile __bit                   B1D64               __at(0x74E4);	// @ (0xE9C * 8 + 4)
#define                                 B1D64_bit           _BIT_ACCESS(B1D6,4)
// B1D6<B1D65>
extern volatile __bit                   B1D65               __at(0x74E5);	// @ (0xE9C * 8 + 5)
#define                                 B1D65_bit           _BIT_ACCESS(B1D6,5)
// B1D6<B1D66>
extern volatile __bit                   B1D66               __at(0x74E6);	// @ (0xE9C * 8 + 6)
#define                                 B1D66_bit           _BIT_ACCESS(B1D6,6)
// B1D6<B1D67>
extern volatile __bit                   B1D67               __at(0x74E7);	// @ (0xE9C * 8 + 7)
#define                                 B1D67_bit           _BIT_ACCESS(B1D6,7)
// B1D7<B1D70>
extern volatile __bit                   B1D70               __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 B1D70_bit           _BIT_ACCESS(B1D7,0)
// B1D7<B1D71>
extern volatile __bit                   B1D71               __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 B1D71_bit           _BIT_ACCESS(B1D7,1)
// B1D7<B1D72>
extern volatile __bit                   B1D72               __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 B1D72_bit           _BIT_ACCESS(B1D7,2)
// B1D7<B1D73>
extern volatile __bit                   B1D73               __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 B1D73_bit           _BIT_ACCESS(B1D7,3)
// B1D7<B1D74>
extern volatile __bit                   B1D74               __at(0x74EC);	// @ (0xE9D * 8 + 4)
#define                                 B1D74_bit           _BIT_ACCESS(B1D7,4)
// B1D7<B1D75>
extern volatile __bit                   B1D75               __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 B1D75_bit           _BIT_ACCESS(B1D7,5)
// B1D7<B1D76>
extern volatile __bit                   B1D76               __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 B1D76_bit           _BIT_ACCESS(B1D7,6)
// B1D7<B1D77>
extern volatile __bit                   B1D77               __at(0x74EF);	// @ (0xE9D * 8 + 7)
#define                                 B1D77_bit           _BIT_ACCESS(B1D7,7)
// B1DLC<B1DLC0>
extern volatile __bit                   B1DLC0              __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 B1DLC0_bit          _BIT_ACCESS(B1DLC,0)
// B1DLC<B1DLC1>
extern volatile __bit                   B1DLC1              __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 B1DLC1_bit          _BIT_ACCESS(B1DLC,1)
// B1DLC<B1DLC2>
extern volatile __bit                   B1DLC2              __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 B1DLC2_bit          _BIT_ACCESS(B1DLC,2)
// B1DLC<B1DLC3>
extern volatile __bit                   B1DLC3              __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 B1DLC3_bit          _BIT_ACCESS(B1DLC,3)
// B1EIDL<B1EID0>
extern volatile __bit                   B1EID0              __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 B1EID0_bit          _BIT_ACCESS(B1EIDL,0)
// B1EIDL<B1EID1>
extern volatile __bit                   B1EID1              __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 B1EID1_bit          _BIT_ACCESS(B1EIDL,1)
// B1EIDH<B1EID10>
extern volatile __bit                   B1EID10             __at(0x749A);	// @ (0xE93 * 8 + 2)
#define                                 B1EID10_bit         _BIT_ACCESS(B1EIDH,2)
// B1EIDH<B1EID11>
extern volatile __bit                   B1EID11             __at(0x749B);	// @ (0xE93 * 8 + 3)
#define                                 B1EID11_bit         _BIT_ACCESS(B1EIDH,3)
// B1EIDH<B1EID12>
extern volatile __bit                   B1EID12             __at(0x749C);	// @ (0xE93 * 8 + 4)
#define                                 B1EID12_bit         _BIT_ACCESS(B1EIDH,4)
// B1EIDH<B1EID13>
extern volatile __bit                   B1EID13             __at(0x749D);	// @ (0xE93 * 8 + 5)
#define                                 B1EID13_bit         _BIT_ACCESS(B1EIDH,5)
// B1EIDH<B1EID14>
extern volatile __bit                   B1EID14             __at(0x749E);	// @ (0xE93 * 8 + 6)
#define                                 B1EID14_bit         _BIT_ACCESS(B1EIDH,6)
// B1EIDH<B1EID15>
extern volatile __bit                   B1EID15             __at(0x749F);	// @ (0xE93 * 8 + 7)
#define                                 B1EID15_bit         _BIT_ACCESS(B1EIDH,7)
// B1SIDL<B1EID16>
extern volatile __bit                   B1EID16             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 B1EID16_bit         _BIT_ACCESS(B1SIDL,0)
// B1SIDL<B1EID17>
extern volatile __bit                   B1EID17             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 B1EID17_bit         _BIT_ACCESS(B1SIDL,1)
// B1EIDL<B1EID2>
extern volatile __bit                   B1EID2              __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 B1EID2_bit          _BIT_ACCESS(B1EIDL,2)
// B1EIDL<B1EID3>
extern volatile __bit                   B1EID3              __at(0x74A3);	// @ (0xE94 * 8 + 3)
#define                                 B1EID3_bit          _BIT_ACCESS(B1EIDL,3)
// B1EIDL<B1EID4>
extern volatile __bit                   B1EID4              __at(0x74A4);	// @ (0xE94 * 8 + 4)
#define                                 B1EID4_bit          _BIT_ACCESS(B1EIDL,4)
// B1EIDL<B1EID5>
extern volatile __bit                   B1EID5              __at(0x74A5);	// @ (0xE94 * 8 + 5)
#define                                 B1EID5_bit          _BIT_ACCESS(B1EIDL,5)
// B1EIDL<B1EID6>
extern volatile __bit                   B1EID6              __at(0x74A6);	// @ (0xE94 * 8 + 6)
