MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
#define                                 B1EID6_bit          _BIT_ACCESS(B1EIDL,6)
// B1EIDL<B1EID7>
extern volatile __bit                   B1EID7              __at(0x74A7);	// @ (0xE94 * 8 + 7)
#define                                 B1EID7_bit          _BIT_ACCESS(B1EIDL,7)
// B1EIDH<B1EID8>
extern volatile __bit                   B1EID8              __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 B1EID8_bit          _BIT_ACCESS(B1EIDH,0)
// B1EIDH<B1EID9>
extern volatile __bit                   B1EID9              __at(0x7499);	// @ (0xE93 * 8 + 1)
#define                                 B1EID9_bit          _BIT_ACCESS(B1EIDH,1)
// B1SIDL<B1EXID>
extern volatile __bit                   B1EXID              __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 B1EXID_bit          _BIT_ACCESS(B1SIDL,3)
// B1CON<B1FILHIT0>
extern volatile __bit                   B1FILHIT0           __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 B1FILHIT0_bit       _BIT_ACCESS(B1CON,0)
// B1CON<B1FILHIT1>
extern volatile __bit                   B1FILHIT1           __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 B1FILHIT1_bit       _BIT_ACCESS(B1CON,1)
// B1CON<B1FILHIT2>
extern volatile __bit                   B1FILHIT2           __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 B1FILHIT2_bit       _BIT_ACCESS(B1CON,2)
// B1CON<B1FILHIT3>
extern volatile __bit                   B1FILHIT3           __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 B1FILHIT3_bit       _BIT_ACCESS(B1CON,3)
// B1CON<B1FILHIT4>
extern volatile __bit                   B1FILHIT4           __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 B1FILHIT4_bit       _BIT_ACCESS(B1CON,4)
// BIE0<B1IE>
extern volatile __bit                   B1IE                __at(0x73F3);	// @ (0xE7E * 8 + 3)
#define                                 B1IE_bit            _BIT_ACCESS(BIE0,3)
// B1DLC<B1RB0>
extern volatile __bit                   B1RB0               __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 B1RB0_bit           _BIT_ACCESS(B1DLC,4)
// B1DLC<B1RB1>
extern volatile __bit                   B1RB1               __at(0x74AD);	// @ (0xE95 * 8 + 5)
#define                                 B1RB1_bit           _BIT_ACCESS(B1DLC,5)
// B1CON<B1RTREN>
extern volatile __bit                   B1RTREN             __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 B1RTREN_bit         _BIT_ACCESS(B1CON,2)
// B1CON<B1RTRRO>
extern volatile __bit                   B1RTRRO             __at(0x7485);	// @ (0xE90 * 8 + 5)
#define                                 B1RTRRO_bit         _BIT_ACCESS(B1CON,5)
// B1CON<B1RXFUL>
extern volatile __bit                   B1RXFUL             __at(0x7487);	// @ (0xE90 * 8 + 7)
#define                                 B1RXFUL_bit         _BIT_ACCESS(B1CON,7)
// B1CON<B1RXM1>
extern volatile __bit                   B1RXM1              __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 B1RXM1_bit          _BIT_ACCESS(B1CON,6)
// B1DLC<B1RXRTR>
extern volatile __bit                   B1RXRTR             __at(0x74AE);	// @ (0xE95 * 8 + 6)
#define                                 B1RXRTR_bit         _BIT_ACCESS(B1DLC,6)
// B1SIDL<B1SID0>
extern volatile __bit                   B1SID0              __at(0x7495);	// @ (0xE92 * 8 + 5)
#define                                 B1SID0_bit          _BIT_ACCESS(B1SIDL,5)
// B1SIDL<B1SID1>
extern volatile __bit                   B1SID1              __at(0x7496);	// @ (0xE92 * 8 + 6)
#define                                 B1SID1_bit          _BIT_ACCESS(B1SIDL,6)
// B1SIDH<B1SID10>
extern volatile __bit                   B1SID10             __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 B1SID10_bit         _BIT_ACCESS(B1SIDH,7)
// B1SIDL<B1SID2>
extern volatile __bit                   B1SID2              __at(0x7497);	// @ (0xE92 * 8 + 7)
#define                                 B1SID2_bit          _BIT_ACCESS(B1SIDL,7)
// B1SIDH<B1SID3>
extern volatile __bit                   B1SID3              __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 B1SID3_bit          _BIT_ACCESS(B1SIDH,0)
// B1SIDH<B1SID4>
extern volatile __bit                   B1SID4              __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 B1SID4_bit          _BIT_ACCESS(B1SIDH,1)
// B1SIDH<B1SID5>
extern volatile __bit                   B1SID5              __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 B1SID5_bit          _BIT_ACCESS(B1SIDH,2)
// B1SIDH<B1SID6>
extern volatile __bit                   B1SID6              __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 B1SID6_bit          _BIT_ACCESS(B1SIDH,3)
// B1SIDH<B1SID7>
extern volatile __bit                   B1SID7              __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 B1SID7_bit          _BIT_ACCESS(B1SIDH,4)
// B1SIDH<B1SID8>
extern volatile __bit                   B1SID8              __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 B1SID8_bit          _BIT_ACCESS(B1SIDH,5)
// B1SIDH<B1SID9>
extern volatile __bit                   B1SID9              __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 B1SID9_bit          _BIT_ACCESS(B1SIDH,6)
// B1SIDL<B1SRR>
extern volatile __bit                   B1SRR               __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 B1SRR_bit           _BIT_ACCESS(B1SIDL,4)
// B1CON<B1TXABT>
extern volatile __bit                   B1TXABT             __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 B1TXABT_bit         _BIT_ACCESS(B1CON,6)
// B1CON<B1TXB3IF>
extern volatile __bit                   B1TXB3IF            __at(0x7487);	// @ (0xE90 * 8 + 7)
#define                                 B1TXB3IF_bit        _BIT_ACCESS(B1CON,7)
// BSEL0<B1TXEN>
extern volatile __bit                   B1TXEN              __at(0x73EB);	// @ (0xE7D * 8 + 3)
#define                                 B1TXEN_bit          _BIT_ACCESS(BSEL0,3)
// B1CON<B1TXERR>
extern volatile __bit                   B1TXERR             __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 B1TXERR_bit         _BIT_ACCESS(B1CON,4)
// B1CON<B1TXLARB>
extern volatile __bit                   B1TXLARB            __at(0x7485);	// @ (0xE90 * 8 + 5)
#define                                 B1TXLARB_bit        _BIT_ACCESS(B1CON,5)
// B1CON<B1TXPRI0>
extern volatile __bit                   B1TXPRI0            __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 B1TXPRI0_bit        _BIT_ACCESS(B1CON,0)
// B1CON<B1TXPRI1>
extern volatile __bit                   B1TXPRI1            __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 B1TXPRI1_bit        _BIT_ACCESS(B1CON,1)
// B1CON<B1TXREQ>
extern volatile __bit                   B1TXREQ             __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 B1TXREQ_bit         _BIT_ACCESS(B1CON,3)
// B2D0<B2D00>
extern volatile __bit                   B2D00               __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 B2D00_bit           _BIT_ACCESS(B2D0,0)
// B2D0<B2D01>
extern volatile __bit                   B2D01               __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 B2D01_bit           _BIT_ACCESS(B2D0,1)
// B2D0<B2D02>
extern volatile __bit                   B2D02               __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 B2D02_bit           _BIT_ACCESS(B2D0,2)
// B2D0<B2D03>
extern volatile __bit                   B2D03               __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 B2D03_bit           _BIT_ACCESS(B2D0,3)
// B2D0<B2D04>
extern volatile __bit                   B2D04               __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 B2D04_bit           _BIT_ACCESS(B2D0,4)
// B2D0<B2D05>
extern volatile __bit                   B2D05               __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 B2D05_bit           _BIT_ACCESS(B2D0,5)
// B2D0<B2D06>
extern volatile __bit                   B2D06               __at(0x7536);	// @ (0xEA6 * 8 + 6)
#define                                 B2D06_bit           _BIT_ACCESS(B2D0,6)
// B2D0<B2D07>
extern volatile __bit                   B2D07               __at(0x7537);	// @ (0xEA6 * 8 + 7)
#define                                 B2D07_bit           _BIT_ACCESS(B2D0,7)
// B2D1<B2D10>
extern volatile __bit                   B2D10               __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 B2D10_bit           _BIT_ACCESS(B2D1,0)
// B2D1<B2D11>
extern volatile __bit                   B2D11               __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 B2D11_bit           _BIT_ACCESS(B2D1,1)
// B2D1<B2D12>
extern volatile __bit                   B2D12               __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 B2D12_bit           _BIT_ACCESS(B2D1,2)
// B2D1<B2D13>
extern volatile __bit                   B2D13               __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 B2D13_bit           _BIT_ACCESS(B2D1,3)
// B2D1<B2D14>
extern volatile __bit                   B2D14               __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 B2D14_bit           _BIT_ACCESS(B2D1,4)
// B2D1<B2D15>
extern volatile __bit                   B2D15               __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 B2D15_bit           _BIT_ACCESS(B2D1,5)
// B2D1<B2D16>
extern volatile __bit                   B2D16               __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 B2D16_bit           _BIT_ACCESS(B2D1,6)
// B2D1<B2D17>
extern volatile __bit                   B2D17               __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 B2D17_bit           _BIT_ACCESS(B2D1,7)
// B2D2<B2D20>
extern volatile __bit                   B2D20               __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 B2D20_bit           _BIT_ACCESS(B2D2,0)
// B2D2<B2D21>
extern volatile __bit                   B2D21               __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 B2D21_bit           _BIT_ACCESS(B2D2,1)
// B2D2<B2D22>
extern volatile __bit                   B2D22               __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 B2D22_bit           _BIT_ACCESS(B2D2,2)
// B2D2<B2D23>
extern volatile __bit                   B2D23               __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 B2D23_bit           _BIT_ACCESS(B2D2,3)
// B2D2<B2D24>
extern volatile __bit                   B2D24               __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 B2D24_bit           _BIT_ACCESS(B2D2,4)
// B2D2<B2D25>
extern volatile __bit                   B2D25               __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 B2D25_bit           _BIT_ACCESS(B2D2,5)
// B2D2<B2D26>
extern volatile __bit                   B2D26               __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 B2D26_bit           _BIT_ACCESS(B2D2,6)
// B2D2<B2D27>
extern volatile __bit                   B2D27               __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 B2D27_bit           _BIT_ACCESS(B2D2,7)
// B2D3<B2D30>
extern volatile __bit                   B2D30               __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 B2D30_bit           _BIT_ACCESS(B2D3,0)
// B2D3<B2D31>
extern volatile __bit                   B2D31               __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 B2D31_bit           _BIT_ACCESS(B2D3,1)
// B2D3<B2D32>
extern volatile __bit                   B2D32               __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 B2D32_bit           _BIT_ACCESS(B2D3,2)
// B2D3<B2D33>
extern volatile __bit                   B2D33               __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 B2D33_bit           _BIT_ACCESS(B2D3,3)
// B2D3<B2D34>
extern volatile __bit                   B2D34               __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 B2D34_bit           _BIT_ACCESS(B2D3,4)
// B2D3<B2D35>
extern volatile __bit                   B2D35               __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 B2D35_bit           _BIT_ACCESS(B2D3,5)
// B2D3<B2D36>
extern volatile __bit                   B2D36               __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 B2D36_bit           _BIT_ACCESS(B2D3,6)
// B2D3<B2D37>
extern volatile __bit                   B2D37               __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 B2D37_bit           _BIT_ACCESS(B2D3,7)
// B2D4<B2D40>
extern volatile __bit                   B2D40               __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 B2D40_bit           _BIT_ACCESS(B2D4,0)
// B2D4<B2D41>
extern volatile __bit                   B2D41               __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 B2D41_bit           _BIT_ACCESS(B2D4,1)
// B2D4<B2D42>
extern volatile __bit                   B2D42               __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 B2D42_bit           _BIT_ACCESS(B2D4,2)
// B2D4<B2D43>
extern volatile __bit                   B2D43               __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 B2D43_bit           _BIT_ACCESS(B2D4,3)
// B2D4<B2D44>
extern volatile __bit                   B2D44               __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 B2D44_bit           _BIT_ACCESS(B2D4,4)
// B2D4<B2D45>
extern volatile __bit                   B2D45               __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 B2D45_bit           _BIT_ACCESS(B2D4,5)
// B2D4<B2D46>
extern volatile __bit                   B2D46               __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 B2D46_bit           _BIT_ACCESS(B2D4,6)
// B2D4<B2D47>
extern volatile __bit                   B2D47               __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 B2D47_bit           _BIT_ACCESS(B2D4,7)
// B2D5<B2D50>
extern volatile __bit                   B2D50               __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 B2D50_bit           _BIT_ACCESS(B2D5,0)
// B2D5<B2D51>
extern volatile __bit                   B2D51               __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 B2D51_bit           _BIT_ACCESS(B2D5,1)
// B2D5<B2D52>
extern volatile __bit                   B2D52               __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 B2D52_bit           _BIT_ACCESS(B2D5,2)
// B2D5<B2D53>
extern volatile __bit                   B2D53               __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 B2D53_bit           _BIT_ACCESS(B2D5,3)
// B2D5<B2D54>
extern volatile __bit                   B2D54               __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 B2D54_bit           _BIT_ACCESS(B2D5,4)
// B2D5<B2D55>
extern volatile __bit                   B2D55               __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 B2D55_bit           _BIT_ACCESS(B2D5,5)
// B2D5<B2D56>
extern volatile __bit                   B2D56               __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 B2D56_bit           _BIT_ACCESS(B2D5,6)
// B2D5<B2D57>
extern volatile __bit                   B2D57               __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 B2D57_bit           _BIT_ACCESS(B2D5,7)
// B2D6<B2D60>
extern volatile __bit                   B2D60               __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 B2D60_bit           _BIT_ACCESS(B2D6,0)
// B2D6<B2D61>
extern volatile __bit                   B2D61               __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 B2D61_bit           _BIT_ACCESS(B2D6,1)
// B2D6<B2D62>
extern volatile __bit                   B2D62               __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 B2D62_bit           _BIT_ACCESS(B2D6,2)
// B2D6<B2D63>
extern volatile __bit                   B2D63               __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 B2D63_bit           _BIT_ACCESS(B2D6,3)
// B2D6<B2D64>
extern volatile __bit                   B2D64               __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 B2D64_bit           _BIT_ACCESS(B2D6,4)
// B2D6<B2D65>
extern volatile __bit                   B2D65               __at(0x7565);	// @ (0xEAC * 8 + 5)
#define                                 B2D65_bit           _BIT_ACCESS(B2D6,5)
// B2D6<B2D66>
extern volatile __bit                   B2D66               __at(0x7566);	// @ (0xEAC * 8 + 6)
#define                                 B2D66_bit           _BIT_ACCESS(B2D6,6)
// B2D6<B2D67>
extern volatile __bit                   B2D67               __at(0x7567);	// @ (0xEAC * 8 + 7)
#define                                 B2D67_bit           _BIT_ACCESS(B2D6,7)
// B2D7<B2D70>
extern volatile __bit                   B2D70               __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 B2D70_bit           _BIT_ACCESS(B2D7,0)
// B2D7<B2D71>
extern volatile __bit                   B2D71               __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 B2D71_bit           _BIT_ACCESS(B2D7,1)
// B2D7<B2D72>
extern volatile __bit                   B2D72               __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 B2D72_bit           _BIT_ACCESS(B2D7,2)
// B2D7<B2D73>
extern volatile __bit                   B2D73               __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 B2D73_bit           _BIT_ACCESS(B2D7,3)
// B2D7<B2D74>
extern volatile __bit                   B2D74               __at(0x756C);	// @ (0xEAD * 8 + 4)
#define                                 B2D74_bit           _BIT_ACCESS(B2D7,4)
// B2D7<B2D75>
extern volatile __bit                   B2D75               __at(0x756D);	// @ (0xEAD * 8 + 5)
#define                                 B2D75_bit           _BIT_ACCESS(B2D7,5)
// B2D7<B2D76>
extern volatile __bit                   B2D76               __at(0x756E);	// @ (0xEAD * 8 + 6)
#define                                 B2D76_bit           _BIT_ACCESS(B2D7,6)
// B2D7<B2D77>
extern volatile __bit                   B2D77               __at(0x756F);	// @ (0xEAD * 8 + 7)
#define                                 B2D77_bit           _BIT_ACCESS(B2D7,7)
// B2DLC<B2DLC0>
extern volatile __bit                   B2DLC0              __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 B2DLC0_bit          _BIT_ACCESS(B2DLC,0)
// B2DLC<B2DLC1>
extern volatile __bit                   B2DLC1              __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 B2DLC1_bit          _BIT_ACCESS(B2DLC,1)
// B2DLC<B2DLC2>
extern volatile __bit                   B2DLC2              __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 B2DLC2_bit          _BIT_ACCESS(B2DLC,2)
// B2DLC<B2DLC3>
extern volatile __bit                   B2DLC3              __at(0x752B);	// @ (0xEA5 * 8 + 3)
#define                                 B2DLC3_bit          _BIT_ACCESS(B2DLC,3)
// B2EIDL<B2EID0>
extern volatile __bit                   B2EID0              __at(0x7520);	// @ (0xEA4 * 8 + 0)
#define                                 B2EID0_bit          _BIT_ACCESS(B2EIDL,0)
// B2EIDL<B2EID1>
extern volatile __bit                   B2EID1              __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 B2EID1_bit          _BIT_ACCESS(B2EIDL,1)
// B2EIDH<B2EID10>
extern volatile __bit                   B2EID10             __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 B2EID10_bit         _BIT_ACCESS(B2EIDH,2)
// B2EIDH<B2EID11>
extern volatile __bit                   B2EID11             __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 B2EID11_bit         _BIT_ACCESS(B2EIDH,3)
// B2EIDH<B2EID12>
extern volatile __bit                   B2EID12             __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 B2EID12_bit         _BIT_ACCESS(B2EIDH,4)
// B2EIDH<B2EID13>
extern volatile __bit                   B2EID13             __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 B2EID13_bit         _BIT_ACCESS(B2EIDH,5)
// B2EIDH<B2EID14>
extern volatile __bit                   B2EID14             __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 B2EID14_bit         _BIT_ACCESS(B2EIDH,6)
// B2EIDH<B2EID15>
extern volatile __bit                   B2EID15             __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 B2EID15_bit         _BIT_ACCESS(B2EIDH,7)
// B2SIDL<B2EID16>
extern volatile __bit                   B2EID16             __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 B2EID16_bit         _BIT_ACCESS(B2SIDL,0)
// B2SIDL<B2EID17>
extern volatile __bit                   B2EID17             __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 B2EID17_bit         _BIT_ACCESS(B2SIDL,1)
// B2EIDL<B2EID2>
extern volatile __bit                   B2EID2              __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 B2EID2_bit          _BIT_ACCESS(B2EIDL,2)
// B2EIDL<B2EID3>
extern volatile __bit                   B2EID3              __at(0x7523);	// @ (0xEA4 * 8 + 3)
#define                                 B2EID3_bit          _BIT_ACCESS(B2EIDL,3)
// B2EIDL<B2EID4>
extern volatile __bit                   B2EID4              __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 B2EID4_bit          _BIT_ACCESS(B2EIDL,4)
// B2EIDL<B2EID5>
extern volatile __bit                   B2EID5              __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 B2EID5_bit          _BIT_ACCESS(B2EIDL,5)
// B2EIDL<B2EID6>
extern volatile __bit                   B2EID6              __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 B2EID6_bit          _BIT_ACCESS(B2EIDL,6)
// B2EIDL<B2EID7>
extern volatile __bit                   B2EID7              __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 B2EID7_bit          _BIT_ACCESS(B2EIDL,7)
// B2EIDH<B2EID8>
extern volatile __bit                   B2EID8              __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 B2EID8_bit          _BIT_ACCESS(B2EIDH,0)
// B2EIDH<B2EID9>
extern volatile __bit                   B2EID9              __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 B2EID9_bit          _BIT_ACCESS(B2EIDH,1)
// B2SIDL<B2EXID>
extern volatile __bit                   B2EXID              __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 B2EXID_bit          _BIT_ACCESS(B2SIDL,3)
// B2SIDL<B2EXIDE>
