MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile __bit                   B4RB0               __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 B4RB0_bit           _BIT_ACCESS(B4DLC,4)
// B4DLC<B4RB1>
extern volatile __bit                   B4RB1               __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 B4RB1_bit           _BIT_ACCESS(B4DLC,5)
// B4CON<B4RTREN>
extern volatile __bit                   B4RTREN             __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 B4RTREN_bit         _BIT_ACCESS(B4CON,2)
// B4CON<B4RTRRO>
extern volatile __bit                   B4RTRRO             __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 B4RTRRO_bit         _BIT_ACCESS(B4CON,5)
// B4CON<B4RXFUL>
extern volatile __bit                   B4RXFUL             __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 B4RXFUL_bit         _BIT_ACCESS(B4CON,7)
// B4CON<B4RXM1>
extern volatile __bit                   B4RXM1              __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 B4RXM1_bit          _BIT_ACCESS(B4CON,6)
// B4DLC<B4RXRTR>
extern volatile __bit                   B4RXRTR             __at(0x762E);	// @ (0xEC5 * 8 + 6)
#define                                 B4RXRTR_bit         _BIT_ACCESS(B4DLC,6)
// B4SIDL<B4SID0>
extern volatile __bit                   B4SID0              __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 B4SID0_bit          _BIT_ACCESS(B4SIDL,5)
// B4SIDL<B4SID1>
extern volatile __bit                   B4SID1              __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 B4SID1_bit          _BIT_ACCESS(B4SIDL,6)
// B4SIDH<B4SID10>
extern volatile __bit                   B4SID10             __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 B4SID10_bit         _BIT_ACCESS(B4SIDH,7)
// B4SIDL<B4SID2>
extern volatile __bit                   B4SID2              __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 B4SID2_bit          _BIT_ACCESS(B4SIDL,7)
// B4SIDH<B4SID3>
extern volatile __bit                   B4SID3              __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 B4SID3_bit          _BIT_ACCESS(B4SIDH,0)
// B4SIDH<B4SID4>
extern volatile __bit                   B4SID4              __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 B4SID4_bit          _BIT_ACCESS(B4SIDH,1)
// B4SIDH<B4SID5>
extern volatile __bit                   B4SID5              __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 B4SID5_bit          _BIT_ACCESS(B4SIDH,2)
// B4SIDH<B4SID6>
extern volatile __bit                   B4SID6              __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 B4SID6_bit          _BIT_ACCESS(B4SIDH,3)
// B4SIDH<B4SID7>
extern volatile __bit                   B4SID7              __at(0x760C);	// @ (0xEC1 * 8 + 4)
#define                                 B4SID7_bit          _BIT_ACCESS(B4SIDH,4)
// B4SIDH<B4SID8>
extern volatile __bit                   B4SID8              __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 B4SID8_bit          _BIT_ACCESS(B4SIDH,5)
// B4SIDH<B4SID9>
extern volatile __bit                   B4SID9              __at(0x760E);	// @ (0xEC1 * 8 + 6)
#define                                 B4SID9_bit          _BIT_ACCESS(B4SIDH,6)
// B4SIDL<B4SRR>
extern volatile __bit                   B4SRR               __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 B4SRR_bit           _BIT_ACCESS(B4SIDL,4)
// B4CON<B4TXABT>
extern volatile __bit                   B4TXABT             __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 B4TXABT_bit         _BIT_ACCESS(B4CON,6)
// B4CON<B4TXB3IF>
extern volatile __bit                   B4TXB3IF            __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 B4TXB3IF_bit        _BIT_ACCESS(B4CON,7)
// BSEL0<B4TXEN>
extern volatile __bit                   B4TXEN              __at(0x73EE);	// @ (0xE7D * 8 + 6)
#define                                 B4TXEN_bit          _BIT_ACCESS(BSEL0,6)
// B4CON<B4TXERR>
extern volatile __bit                   B4TXERR             __at(0x7604);	// @ (0xEC0 * 8 + 4)
#define                                 B4TXERR_bit         _BIT_ACCESS(B4CON,4)
// B4CON<B4TXLARB>
extern volatile __bit                   B4TXLARB            __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 B4TXLARB_bit        _BIT_ACCESS(B4CON,5)
// B4CON<B4TXPRI0>
extern volatile __bit                   B4TXPRI0            __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 B4TXPRI0_bit        _BIT_ACCESS(B4CON,0)
// B4CON<B4TXPRI1>
extern volatile __bit                   B4TXPRI1            __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 B4TXPRI1_bit        _BIT_ACCESS(B4CON,1)
// B4CON<B4TXREQ>
extern volatile __bit                   B4TXREQ             __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 B4TXREQ_bit         _BIT_ACCESS(B4CON,3)
// B5D0<B5D00>
extern volatile __bit                   B5D00               __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 B5D00_bit           _BIT_ACCESS(B5D0,0)
// B5D0<B5D01>
extern volatile __bit                   B5D01               __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 B5D01_bit           _BIT_ACCESS(B5D0,1)
// B5D0<B5D02>
extern volatile __bit                   B5D02               __at(0x76B2);	// @ (0xED6 * 8 + 2)
#define                                 B5D02_bit           _BIT_ACCESS(B5D0,2)
// B5D0<B5D03>
extern volatile __bit                   B5D03               __at(0x76B3);	// @ (0xED6 * 8 + 3)
#define                                 B5D03_bit           _BIT_ACCESS(B5D0,3)
// B5D0<B5D04>
extern volatile __bit                   B5D04               __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 B5D04_bit           _BIT_ACCESS(B5D0,4)
// B5D0<B5D05>
extern volatile __bit                   B5D05               __at(0x76B5);	// @ (0xED6 * 8 + 5)
#define                                 B5D05_bit           _BIT_ACCESS(B5D0,5)
// B5D0<B5D06>
extern volatile __bit                   B5D06               __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 B5D06_bit           _BIT_ACCESS(B5D0,6)
// B5D0<B5D07>
extern volatile __bit                   B5D07               __at(0x76B7);	// @ (0xED6 * 8 + 7)
#define                                 B5D07_bit           _BIT_ACCESS(B5D0,7)
// B5D1<B5D10>
extern volatile __bit                   B5D10               __at(0x76B8);	// @ (0xED7 * 8 + 0)
#define                                 B5D10_bit           _BIT_ACCESS(B5D1,0)
// B5D1<B5D11>
extern volatile __bit                   B5D11               __at(0x76B9);	// @ (0xED7 * 8 + 1)
#define                                 B5D11_bit           _BIT_ACCESS(B5D1,1)
// B5D1<B5D12>
extern volatile __bit                   B5D12               __at(0x76BA);	// @ (0xED7 * 8 + 2)
#define                                 B5D12_bit           _BIT_ACCESS(B5D1,2)
// B5D1<B5D13>
extern volatile __bit                   B5D13               __at(0x76BB);	// @ (0xED7 * 8 + 3)
#define                                 B5D13_bit           _BIT_ACCESS(B5D1,3)
// B5D1<B5D14>
extern volatile __bit                   B5D14               __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 B5D14_bit           _BIT_ACCESS(B5D1,4)
// B5D1<B5D15>
extern volatile __bit                   B5D15               __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 B5D15_bit           _BIT_ACCESS(B5D1,5)
// B5D1<B5D16>
extern volatile __bit                   B5D16               __at(0x76BE);	// @ (0xED7 * 8 + 6)
#define                                 B5D16_bit           _BIT_ACCESS(B5D1,6)
// B5D1<B5D17>
extern volatile __bit                   B5D17               __at(0x76BF);	// @ (0xED7 * 8 + 7)
#define                                 B5D17_bit           _BIT_ACCESS(B5D1,7)
// B5D2<B5D20>
extern volatile __bit                   B5D20               __at(0x76C0);	// @ (0xED8 * 8 + 0)
#define                                 B5D20_bit           _BIT_ACCESS(B5D2,0)
// B5D2<B5D21>
extern volatile __bit                   B5D21               __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 B5D21_bit           _BIT_ACCESS(B5D2,1)
// B5D2<B5D22>
extern volatile __bit                   B5D22               __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 B5D22_bit           _BIT_ACCESS(B5D2,2)
// B5D2<B5D23>
extern volatile __bit                   B5D23               __at(0x76C3);	// @ (0xED8 * 8 + 3)
#define                                 B5D23_bit           _BIT_ACCESS(B5D2,3)
// B5D2<B5D24>
extern volatile __bit                   B5D24               __at(0x76C4);	// @ (0xED8 * 8 + 4)
#define                                 B5D24_bit           _BIT_ACCESS(B5D2,4)
// B5D2<B5D25>
extern volatile __bit                   B5D25               __at(0x76C5);	// @ (0xED8 * 8 + 5)
#define                                 B5D25_bit           _BIT_ACCESS(B5D2,5)
// B5D2<B5D26>
extern volatile __bit                   B5D26               __at(0x76C6);	// @ (0xED8 * 8 + 6)
#define                                 B5D26_bit           _BIT_ACCESS(B5D2,6)
// B5D2<B5D27>
extern volatile __bit                   B5D27               __at(0x76C7);	// @ (0xED8 * 8 + 7)
#define                                 B5D27_bit           _BIT_ACCESS(B5D2,7)
// B5D3<B5D30>
extern volatile __bit                   B5D30               __at(0x76C8);	// @ (0xED9 * 8 + 0)
#define                                 B5D30_bit           _BIT_ACCESS(B5D3,0)
// B5D3<B5D31>
extern volatile __bit                   B5D31               __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 B5D31_bit           _BIT_ACCESS(B5D3,1)
// B5D3<B5D32>
extern volatile __bit                   B5D32               __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 B5D32_bit           _BIT_ACCESS(B5D3,2)
// B5D3<B5D33>
extern volatile __bit                   B5D33               __at(0x76CB);	// @ (0xED9 * 8 + 3)
#define                                 B5D33_bit           _BIT_ACCESS(B5D3,3)
// B5D3<B5D34>
extern volatile __bit                   B5D34               __at(0x76CC);	// @ (0xED9 * 8 + 4)
#define                                 B5D34_bit           _BIT_ACCESS(B5D3,4)
// B5D3<B5D35>
extern volatile __bit                   B5D35               __at(0x76CD);	// @ (0xED9 * 8 + 5)
#define                                 B5D35_bit           _BIT_ACCESS(B5D3,5)
// B5D3<B5D36>
extern volatile __bit                   B5D36               __at(0x76CE);	// @ (0xED9 * 8 + 6)
#define                                 B5D36_bit           _BIT_ACCESS(B5D3,6)
// B5D3<B5D37>
extern volatile __bit                   B5D37               __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 B5D37_bit           _BIT_ACCESS(B5D3,7)
// B5D4<B5D40>
extern volatile __bit                   B5D40               __at(0x76D0);	// @ (0xEDA * 8 + 0)
#define                                 B5D40_bit           _BIT_ACCESS(B5D4,0)
// B5D4<B5D41>
extern volatile __bit                   B5D41               __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 B5D41_bit           _BIT_ACCESS(B5D4,1)
// B5D4<B5D42>
extern volatile __bit                   B5D42               __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 B5D42_bit           _BIT_ACCESS(B5D4,2)
// B5D4<B5D43>
extern volatile __bit                   B5D43               __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 B5D43_bit           _BIT_ACCESS(B5D4,3)
// B5D4<B5D44>
extern volatile __bit                   B5D44               __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 B5D44_bit           _BIT_ACCESS(B5D4,4)
// B5D4<B5D45>
extern volatile __bit                   B5D45               __at(0x76D5);	// @ (0xEDA * 8 + 5)
#define                                 B5D45_bit           _BIT_ACCESS(B5D4,5)
// B5D4<B5D46>
extern volatile __bit                   B5D46               __at(0x76D6);	// @ (0xEDA * 8 + 6)
#define                                 B5D46_bit           _BIT_ACCESS(B5D4,6)
// B5D4<B5D47>
extern volatile __bit                   B5D47               __at(0x76D7);	// @ (0xEDA * 8 + 7)
#define                                 B5D47_bit           _BIT_ACCESS(B5D4,7)
// B5D5<B5D50>
extern volatile __bit                   B5D50               __at(0x76D8);	// @ (0xEDB * 8 + 0)
#define                                 B5D50_bit           _BIT_ACCESS(B5D5,0)
// B5D5<B5D51>
extern volatile __bit                   B5D51               __at(0x76D9);	// @ (0xEDB * 8 + 1)
#define                                 B5D51_bit           _BIT_ACCESS(B5D5,1)
// B5D5<B5D52>
extern volatile __bit                   B5D52               __at(0x76DA);	// @ (0xEDB * 8 + 2)
#define                                 B5D52_bit           _BIT_ACCESS(B5D5,2)
// B5D5<B5D53>
extern volatile __bit                   B5D53               __at(0x76DB);	// @ (0xEDB * 8 + 3)
#define                                 B5D53_bit           _BIT_ACCESS(B5D5,3)
// B5D5<B5D54>
extern volatile __bit                   B5D54               __at(0x76DC);	// @ (0xEDB * 8 + 4)
#define                                 B5D54_bit           _BIT_ACCESS(B5D5,4)
// B5D5<B5D55>
extern volatile __bit                   B5D55               __at(0x76DD);	// @ (0xEDB * 8 + 5)
#define                                 B5D55_bit           _BIT_ACCESS(B5D5,5)
// B5D5<B5D56>
extern volatile __bit                   B5D56               __at(0x76DE);	// @ (0xEDB * 8 + 6)
#define                                 B5D56_bit           _BIT_ACCESS(B5D5,6)
// B5D5<B5D57>
extern volatile __bit                   B5D57               __at(0x76DF);	// @ (0xEDB * 8 + 7)
#define                                 B5D57_bit           _BIT_ACCESS(B5D5,7)
// B5D6<B5D60>
extern volatile __bit                   B5D60               __at(0x76E0);	// @ (0xEDC * 8 + 0)
#define                                 B5D60_bit           _BIT_ACCESS(B5D6,0)
// B5D6<B5D61>
extern volatile __bit                   B5D61               __at(0x76E1);	// @ (0xEDC * 8 + 1)
#define                                 B5D61_bit           _BIT_ACCESS(B5D6,1)
// B5D6<B5D62>
extern volatile __bit                   B5D62               __at(0x76E2);	// @ (0xEDC * 8 + 2)
#define                                 B5D62_bit           _BIT_ACCESS(B5D6,2)
// B5D6<B5D63>
extern volatile __bit                   B5D63               __at(0x76E3);	// @ (0xEDC * 8 + 3)
#define                                 B5D63_bit           _BIT_ACCESS(B5D6,3)
// B5D6<B5D64>
extern volatile __bit                   B5D64               __at(0x76E4);	// @ (0xEDC * 8 + 4)
#define                                 B5D64_bit           _BIT_ACCESS(B5D6,4)
// B5D6<B5D65>
extern volatile __bit                   B5D65               __at(0x76E5);	// @ (0xEDC * 8 + 5)
#define                                 B5D65_bit           _BIT_ACCESS(B5D6,5)
// B5D6<B5D66>
extern volatile __bit                   B5D66               __at(0x76E6);	// @ (0xEDC * 8 + 6)
#define                                 B5D66_bit           _BIT_ACCESS(B5D6,6)
// B5D6<B5D67>
extern volatile __bit                   B5D67               __at(0x76E7);	// @ (0xEDC * 8 + 7)
#define                                 B5D67_bit           _BIT_ACCESS(B5D6,7)
// B5D7<B5D70>
extern volatile __bit                   B5D70               __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 B5D70_bit           _BIT_ACCESS(B5D7,0)
// B5D7<B5D71>
extern volatile __bit                   B5D71               __at(0x76E9);	// @ (0xEDD * 8 + 1)
#define                                 B5D71_bit           _BIT_ACCESS(B5D7,1)
// B5D7<B5D72>
extern volatile __bit                   B5D72               __at(0x76EA);	// @ (0xEDD * 8 + 2)
#define                                 B5D72_bit           _BIT_ACCESS(B5D7,2)
// B5D7<B5D73>
extern volatile __bit                   B5D73               __at(0x76EB);	// @ (0xEDD * 8 + 3)
#define                                 B5D73_bit           _BIT_ACCESS(B5D7,3)
// B5D7<B5D74>
extern volatile __bit                   B5D74               __at(0x76EC);	// @ (0xEDD * 8 + 4)
#define                                 B5D74_bit           _BIT_ACCESS(B5D7,4)
// B5D7<B5D75>
extern volatile __bit                   B5D75               __at(0x76ED);	// @ (0xEDD * 8 + 5)
#define                                 B5D75_bit           _BIT_ACCESS(B5D7,5)
// B5D7<B5D76>
extern volatile __bit                   B5D76               __at(0x76EE);	// @ (0xEDD * 8 + 6)
#define                                 B5D76_bit           _BIT_ACCESS(B5D7,6)
// B5D7<B5D77>
extern volatile __bit                   B5D77               __at(0x76EF);	// @ (0xEDD * 8 + 7)
#define                                 B5D77_bit           _BIT_ACCESS(B5D7,7)
// B5DLC<B5DLC0>
extern volatile __bit                   B5DLC0              __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 B5DLC0_bit          _BIT_ACCESS(B5DLC,0)
// B5DLC<B5DLC1>
extern volatile __bit                   B5DLC1              __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 B5DLC1_bit          _BIT_ACCESS(B5DLC,1)
// B5DLC<B5DLC2>
extern volatile __bit                   B5DLC2              __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 B5DLC2_bit          _BIT_ACCESS(B5DLC,2)
// B5DLC<B5DLC3>
extern volatile __bit                   B5DLC3              __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 B5DLC3_bit          _BIT_ACCESS(B5DLC,3)
// B5EIDL<B5EID0>
extern volatile __bit                   B5EID0              __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 B5EID0_bit          _BIT_ACCESS(B5EIDL,0)
// B5EIDL<B5EID1>
extern volatile __bit                   B5EID1              __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 B5EID1_bit          _BIT_ACCESS(B5EIDL,1)
// B5EIDH<B5EID10>
extern volatile __bit                   B5EID10             __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 B5EID10_bit         _BIT_ACCESS(B5EIDH,2)
// B5EIDH<B5EID11>
extern volatile __bit                   B5EID11             __at(0x769B);	// @ (0xED3 * 8 + 3)
#define                                 B5EID11_bit         _BIT_ACCESS(B5EIDH,3)
// B5EIDH<B5EID12>
extern volatile __bit                   B5EID12             __at(0x769C);	// @ (0xED3 * 8 + 4)
#define                                 B5EID12_bit         _BIT_ACCESS(B5EIDH,4)
// B5EIDH<B5EID13>
extern volatile __bit                   B5EID13             __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 B5EID13_bit         _BIT_ACCESS(B5EIDH,5)
// B5EIDH<B5EID14>
extern volatile __bit                   B5EID14             __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 B5EID14_bit         _BIT_ACCESS(B5EIDH,6)
// B5EIDH<B5EID15>
extern volatile __bit                   B5EID15             __at(0x769F);	// @ (0xED3 * 8 + 7)
#define                                 B5EID15_bit         _BIT_ACCESS(B5EIDH,7)
// B5SIDL<B5EID16>
extern volatile __bit                   B5EID16             __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 B5EID16_bit         _BIT_ACCESS(B5SIDL,0)
// B5SIDL<B5EID17>
extern volatile __bit                   B5EID17             __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 B5EID17_bit         _BIT_ACCESS(B5SIDL,1)
// B5EIDL<B5EID2>
extern volatile __bit                   B5EID2              __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 B5EID2_bit          _BIT_ACCESS(B5EIDL,2)
// B5EIDL<B5EID3>
extern volatile __bit                   B5EID3              __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 B5EID3_bit          _BIT_ACCESS(B5EIDL,3)
// B5EIDL<B5EID4>
extern volatile __bit                   B5EID4              __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 B5EID4_bit          _BIT_ACCESS(B5EIDL,4)
// B5EIDL<B5EID5>
extern volatile __bit                   B5EID5              __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 B5EID5_bit          _BIT_ACCESS(B5EIDL,5)
// B5EIDL<B5EID6>
extern volatile __bit                   B5EID6              __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 B5EID6_bit          _BIT_ACCESS(B5EIDL,6)
// B5EIDL<B5EID7>
extern volatile __bit                   B5EID7              __at(0x76A7);	// @ (0xED4 * 8 + 7)
#define                                 B5EID7_bit          _BIT_ACCESS(B5EIDL,7)
// B5EIDH<B5EID8>
extern volatile __bit                   B5EID8              __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 B5EID8_bit          _BIT_ACCESS(B5EIDH,0)
// B5EIDH<B5EID9>
extern volatile __bit                   B5EID9              __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 B5EID9_bit          _BIT_ACCESS(B5EIDH,1)
// B5SIDL<B5EXID>
extern volatile __bit                   B5EXID              __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 B5EXID_bit          _BIT_ACCESS(B5SIDL,3)
// B5SIDL<B5EXIDE>
extern volatile __bit                   B5EXIDE             __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 B5EXIDE_bit         _BIT_ACCESS(B5SIDL,3)
// B5CON<B5FILHIT0>
extern volatile __bit                   B5FILHIT0           __at(0x7680);	// @ (0xED0 * 8 + 0)
#define                                 B5FILHIT0_bit       _BIT_ACCESS(B5CON,0)
// B5CON<B5FILHIT1>
extern volatile __bit                   B5FILHIT1           __at(0x7681);	// @ (0xED0 * 8 + 1)
#define                                 B5FILHIT1_bit       _BIT_ACCESS(B5CON,1)
// B5CON<B5FILHIT2>
extern volatile __bit                   B5FILHIT2           __at(0x7682);	// @ (0xED0 * 8 + 2)
#define                                 B5FILHIT2_bit       _BIT_ACCESS(B5CON,2)
// B5CON<B5FILHIT3>
extern volatile __bit                   B5FILHIT3           __at(0x7683);	// @ (0xED0 * 8 + 3)
#define                                 B5FILHIT3_bit       _BIT_ACCESS(B5CON,3)
// B5CON<B5FILHIT4>
extern volatile __bit                   B5FILHIT4           __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 B5FILHIT4_bit       _BIT_ACCESS(B5CON,4)
// BIE0<B5IE>
extern volatile __bit                   B5IE                __at(0x73F7);	// @ (0xE7E * 8 + 7)
#define                                 B5IE_bit            _BIT_ACCESS(BIE0,7)
// B5DLC<B5RB0>
extern volatile __bit                   B5RB0               __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 B5RB0_bit           _BIT_ACCESS(B5DLC,4)
// B5DLC<B5RB1>
extern volatile __bit                   B5RB1               __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 B5RB1_bit           _BIT_ACCESS(B5DLC,5)
// B5CON<B5RTREN>
extern volatile __bit                   B5RTREN             __at(0x7682);	// @ (0xED0 * 8 + 2)
#define                                 B5RTREN_bit         _BIT_ACCESS(B5CON,2)
// B5CON<B5RTRRO>
extern volatile __bit                   B5RTRRO             __at(0x7685);	// @ (0xED0 * 8 + 5)
