MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K80/mcu.h
extern volatile __bit                   TMR2ON              __at(0x7E52);	// @ (0xFCA * 8 + 2)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,2)
// T3CON<TMR3CS0>
extern volatile __bit                   TMR3CS0             __at(0x7D8E);	// @ (0xFB1 * 8 + 6)
#define                                 TMR3CS0_bit         _BIT_ACCESS(T3CON,6)
// T3CON<TMR3CS1>
extern volatile __bit                   TMR3CS1             __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 TMR3CS1_bit         _BIT_ACCESS(T3CON,7)
// T3GCON<TMR3GE>
extern volatile __bit                   TMR3GE              __at(0x7D87);	// @ (0xFB0 * 8 + 7)
#define                                 TMR3GE_bit          _BIT_ACCESS(T3GCON,7)
// PIE2<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE2,0)
// PIR2<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR2,0)
// IPR2<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR2,0)
// PIE2<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x7D01);	// @ (0xFA0 * 8 + 1)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE2,1)
// PIR2<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x7D09);	// @ (0xFA1 * 8 + 1)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR2,1)
// IPR2<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x7D11);	// @ (0xFA2 * 8 + 1)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR2,1)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x7D88);	// @ (0xFB1 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE4<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR4,7)
// IPR4<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR4,7)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x7AC4);	// @ (0xF58 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,2)
// RCON<TO>
extern volatile __bit                   TO                  __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 TO_bit              _BIT_ACCESS(RCON,3)
// ADCON1<TRIGSEL0>
extern volatile __bit                   TRIGSEL0            __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TRIGSEL0_bit        _BIT_ACCESS(ADCON1,6)
// ADCON1<TRIGSEL1>
extern volatile __bit                   TRIGSEL1            __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 TRIGSEL1_bit        _BIT_ACCESS(ADCON1,7)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x7C90);	// @ (0xF92 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x7C91);	// @ (0xF92 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x7C92);	// @ (0xF92 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x7C93);	// @ (0xF92 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x7C95);	// @ (0xF92 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x7C96);	// @ (0xF92 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x7C97);	// @ (0xF92 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x7C98);	// @ (0xF93 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x7C99);	// @ (0xF93 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x7C9A);	// @ (0xF93 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x7C9B);	// @ (0xF93 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x7C9C);	// @ (0xF93 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x7C9D);	// @ (0xF93 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x7C9E);	// @ (0xF93 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x7C9F);	// @ (0xF93 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x7CA0);	// @ (0xF94 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x7CA1);	// @ (0xF94 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x7CA7);	// @ (0xF94 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TXSTA1<TRMT1>
extern volatile __bit                   TRMT1               __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 TRMT1_bit           _BIT_ACCESS(TXSTA1,1)
// TXSTA2<TRMT2>
extern volatile __bit                   TRMT2               __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 TRMT2_bit           _BIT_ACCESS(TXSTA2,1)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x7CD8);	// @ (0xF9B * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x7CD9);	// @ (0xF9B * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x7CDA);	// @ (0xF9B * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x7CDB);	// @ (0xF9B * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x7CDC);	// @ (0xF9B * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x7CDD);	// @ (0xF9B * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// TXBIE<TX0IE>
extern volatile __bit                   TX0IE               __at(0x73FA);	// @ (0xE7F * 8 + 2)
#define                                 TX0IE_bit           _BIT_ACCESS(TXBIE,2)
// TXB0CON<TX0IF>
extern volatile __bit                   TX0IF               __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 TX0IF_bit           _BIT_ACCESS(TXB0CON,7)
// PIE1<TX1IE>
extern volatile __bit _DEPRECATED       TX1IE               __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<TX1IF>
extern volatile __bit _DEPRECATED       TX1IF               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR1,4)
// IPR1<TX1IP>
extern volatile __bit                   TX1IP               __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TX1IP_bit           _BIT_ACCESS(IPR1,4)
// CIOCON<TX2EN>
extern volatile __bit                   TX2EN               __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 TX2EN_bit           _BIT_ACCESS(CIOCON,6)
// PIE3<TX2IE>
extern volatile __bit _DEPRECATED       TX2IE               __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX2IF>
extern volatile __bit _DEPRECATED       TX2IF               __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,4)
// IPR3<TX2IP>
extern volatile __bit                   TX2IP               __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TX2IP_bit           _BIT_ACCESS(IPR3,4)
// CIOCON<TX2SRC>
extern volatile __bit                   TX2SRC              __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 TX2SRC_bit          _BIT_ACCESS(CIOCON,7)
// TXSTA1<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX8_92>
extern volatile __bit                   TX8_92              __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 TX8_92_bit          _BIT_ACCESS(TXSTA2,6)
// TXSTA1<TX91>
extern volatile __bit                   TX91                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX92>
extern volatile __bit                   TX92                __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 TX92_bit            _BIT_ACCESS(TXSTA2,6)
// TXSTA1<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TX9D2>
extern volatile __bit                   TX9D2               __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 TX9D2_bit           _BIT_ACCESS(TXSTA2,0)
// TXB0CON<TXB0ABT>
extern volatile __bit                   TXB0ABT             __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 TXB0ABT_bit         _BIT_ACCESS(TXB0CON,6)
// TXB0D0<TXB0D00>
extern volatile __bit                   TXB0D00             __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 TXB0D00_bit         _BIT_ACCESS(TXB0D0,0)
// TXB0D0<TXB0D01>
extern volatile __bit                   TXB0D01             __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 TXB0D01_bit         _BIT_ACCESS(TXB0D0,1)
// TXB0D0<TXB0D02>
extern volatile __bit                   TXB0D02             __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 TXB0D02_bit         _BIT_ACCESS(TXB0D0,2)
// TXB0D0<TXB0D03>
extern volatile __bit                   TXB0D03             __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 TXB0D03_bit         _BIT_ACCESS(TXB0D0,3)
// TXB0D0<TXB0D04>
extern volatile __bit                   TXB0D04             __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 TXB0D04_bit         _BIT_ACCESS(TXB0D0,4)
// TXB0D0<TXB0D05>
extern volatile __bit                   TXB0D05             __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 TXB0D05_bit         _BIT_ACCESS(TXB0D0,5)
// TXB0D0<TXB0D06>
extern volatile __bit                   TXB0D06             __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 TXB0D06_bit         _BIT_ACCESS(TXB0D0,6)
// TXB0D0<TXB0D07>
extern volatile __bit                   TXB0D07             __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 TXB0D07_bit         _BIT_ACCESS(TXB0D0,7)
// TXB0D1<TXB0D10>
extern volatile __bit                   TXB0D10             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 TXB0D10_bit         _BIT_ACCESS(TXB0D1,0)
// TXB0D1<TXB0D11>
extern volatile __bit                   TXB0D11             __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 TXB0D11_bit         _BIT_ACCESS(TXB0D1,1)
// TXB0D1<TXB0D12>
extern volatile __bit                   TXB0D12             __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 TXB0D12_bit         _BIT_ACCESS(TXB0D1,2)
// TXB0D1<TXB0D13>
extern volatile __bit                   TXB0D13             __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 TXB0D13_bit         _BIT_ACCESS(TXB0D1,3)
// TXB0D1<TXB0D14>
extern volatile __bit                   TXB0D14             __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 TXB0D14_bit         _BIT_ACCESS(TXB0D1,4)
// TXB0D1<TXB0D15>
extern volatile __bit                   TXB0D15             __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 TXB0D15_bit         _BIT_ACCESS(TXB0D1,5)
// TXB0D1<TXB0D16>
extern volatile __bit                   TXB0D16             __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 TXB0D16_bit         _BIT_ACCESS(TXB0D1,6)
// TXB0D1<TXB0D17>
extern volatile __bit                   TXB0D17             __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 TXB0D17_bit         _BIT_ACCESS(TXB0D1,7)
// TXB0D2<TXB0D20>
extern volatile __bit                   TXB0D20             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 TXB0D20_bit         _BIT_ACCESS(TXB0D2,0)
// TXB0D2<TXB0D21>
extern volatile __bit                   TXB0D21             __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 TXB0D21_bit         _BIT_ACCESS(TXB0D2,1)
// TXB0D2<TXB0D22>
extern volatile __bit                   TXB0D22             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 TXB0D22_bit         _BIT_ACCESS(TXB0D2,2)
// TXB0D2<TXB0D23>
extern volatile __bit                   TXB0D23             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 TXB0D23_bit         _BIT_ACCESS(TXB0D2,3)
// TXB0D2<TXB0D24>
extern volatile __bit                   TXB0D24             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 TXB0D24_bit         _BIT_ACCESS(TXB0D2,4)
// TXB0D2<TXB0D25>
extern volatile __bit                   TXB0D25             __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 TXB0D25_bit         _BIT_ACCESS(TXB0D2,5)
// TXB0D2<TXB0D26>
extern volatile __bit                   TXB0D26             __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 TXB0D26_bit         _BIT_ACCESS(TXB0D2,6)
// TXB0D2<TXB0D27>
extern volatile __bit                   TXB0D27             __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 TXB0D27_bit         _BIT_ACCESS(TXB0D2,7)
// TXB0D3<TXB0D30>
extern volatile __bit                   TXB0D30             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 TXB0D30_bit         _BIT_ACCESS(TXB0D3,0)
// TXB0D3<TXB0D31>
extern volatile __bit                   TXB0D31             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 TXB0D31_bit         _BIT_ACCESS(TXB0D3,1)
// TXB0D3<TXB0D32>
extern volatile __bit                   TXB0D32             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 TXB0D32_bit         _BIT_ACCESS(TXB0D3,2)
// TXB0D3<TXB0D33>
extern volatile __bit                   TXB0D33             __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 TXB0D33_bit         _BIT_ACCESS(TXB0D3,3)
// TXB0D3<TXB0D34>
extern volatile __bit                   TXB0D34             __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 TXB0D34_bit         _BIT_ACCESS(TXB0D3,4)
// TXB0D3<TXB0D35>
extern volatile __bit                   TXB0D35             __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 TXB0D35_bit         _BIT_ACCESS(TXB0D3,5)
// TXB0D3<TXB0D36>
extern volatile __bit                   TXB0D36             __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 TXB0D36_bit         _BIT_ACCESS(TXB0D3,6)
// TXB0D3<TXB0D37>
extern volatile __bit                   TXB0D37             __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 TXB0D37_bit         _BIT_ACCESS(TXB0D3,7)
// TXB0D4<TXB0D40>
extern volatile __bit                   TXB0D40             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 TXB0D40_bit         _BIT_ACCESS(TXB0D4,0)
// TXB0D4<TXB0D41>
extern volatile __bit                   TXB0D41             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 TXB0D41_bit         _BIT_ACCESS(TXB0D4,1)
// TXB0D4<TXB0D42>
extern volatile __bit                   TXB0D42             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 TXB0D42_bit         _BIT_ACCESS(TXB0D4,2)
// TXB0D4<TXB0D43>
extern volatile __bit                   TXB0D43             __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 TXB0D43_bit         _BIT_ACCESS(TXB0D4,3)
// TXB0D4<TXB0D44>
extern volatile __bit                   TXB0D44             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 TXB0D44_bit         _BIT_ACCESS(TXB0D4,4)
// TXB0D4<TXB0D45>
extern volatile __bit                   TXB0D45             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 TXB0D45_bit         _BIT_ACCESS(TXB0D4,5)
// TXB0D4<TXB0D46>
extern volatile __bit                   TXB0D46             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 TXB0D46_bit         _BIT_ACCESS(TXB0D4,6)
// TXB0D4<TXB0D47>
extern volatile __bit                   TXB0D47             __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 TXB0D47_bit         _BIT_ACCESS(TXB0D4,7)
// TXB0D5<TXB0D50>
extern volatile __bit                   TXB0D50             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 TXB0D50_bit         _BIT_ACCESS(TXB0D5,0)
// TXB0D5<TXB0D51>
extern volatile __bit                   TXB0D51             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 TXB0D51_bit         _BIT_ACCESS(TXB0D5,1)
// TXB0D5<TXB0D52>
extern volatile __bit                   TXB0D52             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 TXB0D52_bit         _BIT_ACCESS(TXB0D5,2)
// TXB0D5<TXB0D53>
extern volatile __bit                   TXB0D53             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 TXB0D53_bit         _BIT_ACCESS(TXB0D5,3)
// TXB0D5<TXB0D54>
extern volatile __bit                   TXB0D54             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 TXB0D54_bit         _BIT_ACCESS(TXB0D5,4)
// TXB0D5<TXB0D55>
extern volatile __bit                   TXB0D55             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 TXB0D55_bit         _BIT_ACCESS(TXB0D5,5)
// TXB0D5<TXB0D56>
extern volatile __bit                   TXB0D56             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 TXB0D56_bit         _BIT_ACCESS(TXB0D5,6)
// TXB0D5<TXB0D57>
extern volatile __bit                   TXB0D57             __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 TXB0D57_bit         _BIT_ACCESS(TXB0D5,7)
// TXB0D6<TXB0D60>
extern volatile __bit                   TXB0D60             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 TXB0D60_bit         _BIT_ACCESS(TXB0D6,0)
// TXB0D6<TXB0D61>
extern volatile __bit                   TXB0D61             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 TXB0D61_bit         _BIT_ACCESS(TXB0D6,1)
// TXB0D6<TXB0D62>
extern volatile __bit                   TXB0D62             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 TXB0D62_bit         _BIT_ACCESS(TXB0D6,2)
// TXB0D6<TXB0D63>
extern volatile __bit                   TXB0D63             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 TXB0D63_bit         _BIT_ACCESS(TXB0D6,3)
// TXB0D6<TXB0D64>
extern volatile __bit                   TXB0D64             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 TXB0D64_bit         _BIT_ACCESS(TXB0D6,4)
// TXB0D6<TXB0D65>
extern volatile __bit                   TXB0D65             __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 TXB0D65_bit         _BIT_ACCESS(TXB0D6,5)
// TXB0D6<TXB0D66>
extern volatile __bit                   TXB0D66             __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 TXB0D66_bit         _BIT_ACCESS(TXB0D6,6)
// TXB0D6<TXB0D67>
extern volatile __bit                   TXB0D67             __at(0x7967);	// @ (0xF2C * 8 + 7)
